{
    "2048": {
        "about": "2048 is a single-player mathematical puzzle game where you merge tiles with equal numbers. The goal of the game is to merge the tiles until you have 2048. With each merger of tiles the value doubles. You can slide tiles in any direction to make the identical tiles merge. The grid on which you play is 4x4 so you don't have a lot of space to maneuvre. Try keep some free spaces.",
        "controls": "You can move the tiles using the arrow keys or by swiping.",
        "developer": "Gabriele Cirulli",
        "display_name": "2048",
        "iframe_url": "/gamefiles/2048/",
        "image": "/images/2048.avif"
    },
    "100metersrace": {
        "about": "100 Meters Race is a fantastic game of athletics and running! You must compete in the fastest race on earth – the 100m sprint! You are running against other opponents and must try to outpace them and win in record time.",
        "controls": "Press left and right mouse buttons to run.",
        "developer": "Code This Lab",
        "display_name": "100 Meters Race",
        "iframe_url": "/gamefiles/100metersrace/",
        "image": "/images/100metersrace.avif"
    },
    "1v1lol": {
        "about": "1v1.lol is a competitive online third-person shooter where you build your way around the map tactically. You can build platforms, ramps, and walls to aid your defenses and gain an advantage. The main game mode is 1v1 battle royale, where the winner is the last player standing.",
        "controls": "Use LMB to shoot/build. Use WASD to move. Use Space bar to jump. Use Shift to crouch. Use Z, X, C, V, or Y to switch building platforms. Use F, 1, or 2 to switch weapons. R to rotate stair/reload. G to make door on platforms. E to open doors.",
        "developer": "Lior Alterman",
        "display_name": "1v1.lol",
        "iframe_url": "/gamefiles/1v1lol/",
        "image": "/images/1v1lol.png"
    },
    "2048cupcakes": {
        "about": "This online game has the same basic features as the 2048 game. The aim is to create the highest possible number - instead of a number, however, this time there are different cupcake varieties. Match together different cupcake types - each pair matched produces the next level of cupcake. The aim is to progress until you create the final type of cupcake.",
        "controls": "Use your arrow keys to move the tiles. When two tiles with the same symbol touch, they get promoted!",
        "developer": "Gabriele Cirulli",
        "display_name": "2048 Cupcakes",
        "iframe_url": "/gamefiles/2048cupcakes/",
        "image": "/images/2048cupcakes.png"
    },
    "78hourrain": {
        "about": "78 Hour Rain is a survival-horror game set in a procedurally generated house.  Stand your ground against three faceless intruders by setting beartraps and barricading doorways. Survive for three days and prove yourself worthy, or become another forgotten story of The House. And stay out of the darkness. They can feel it.",
        "controls": "WASD - Move, Mouse - Look, Shift - Run, Right-Click - Take/Interact,Left-Click - Swing Axe / Throw, F - Flashlight, Hold E - Wind Trap, Hold Q - Wind Timer, Hold R - Build/Barricade, Hold TAB - Check Inventory, P - Pause, J - Journal",
        "developer": "Signol_Games",
        "display_name": "78 Hour Rain",
        "iframe_url": "/gamefiles/78hourrain/",
        "image": "/images/78hourrain.png"
    },
    "8-ball": {
        "about": "You'll need some sharp skills in this challenging and fun billiards game. Grab the cue and start sinking shots while you race against the clock. It's time to find out if you'll be the first player to sink the 8 ball and declare victory!",
        "controls": "Drag left mouse button backward to adjust power, release to hit.",
        "developer": "Inlogic Software",
        "display_name": "8 Ball",
        "iframe_url": "/gamefiles/8-Ball/",
        "image": "/images/8ball.png"
    },
    "adcap": {
        "about": "Start with a humble lemonade stand, and squeeze your way to total fiscal domination! Earn ridiculous sums of cash, diversify your investments, and attract smarmy Angel Investors to give your businesses a boost!",
        "controls": "AdVenture Capitalist offers simple game mechanics and one-tap controls, use your mouse to click buttons",
        "developer": "Hyper Hippo Entertainment",
        "display_name": "AdCap",
        "iframe_url": "/gamefiles/adcap/",
        "image": "/images/adcap.jpg"
    },
    "ageofwar": {
        "about": "Age of War is an epic base defense strategy game where you fight a continuous war. Keep creating units to protect your base and destroy the enemy. When you earn enough XP, your civilization will evolve through the ages, offering new technologies to utilize in combat.",
        "controls": "Left click to deploy a unit.",
        "developer": "Louissi",
        "display_name": "Age of War",
        "iframe_url": "/swf?notebook=ageofwar",
        "image": "/images/ageofwar.jpeg"
    },
    "alienhominid": {
        "about": "Alien Hominid is a side-scrolling shooter in a similar vein to games such as Metal Slug, where one hit instantly kills and has a two-player simultaneous play. Players take over as the titular hominid, who has to fend off waves of secret agents.",
        "controls": " arrow keys, A key, and S key",
        "developer": "The Behemoth, Tuna Technologies, Tuna Interactive",
        "display_name": "Alien Hominid",
        "iframe_url": "/swf?notebook=alienhominid",
        "image": "/images/alienhominid.png"
    },
    "anaveragedayatthecatcafe": {
        "about": "all manners of creatures line down the block to get your signature drinks! but how long can you keep the cafe open, when strange customers arise in the night?",
        "controls": "Move - WASD/Arrow keys, Interact - E/Space, Close - C/Esc",
        "developer": "angela he, Alex Rose, atmospherium on Itch.io",
        "display_name": "An Average Day at the Cat Cafe",
        "iframe_url": "/gamefiles/anaveragedayatthecatcafe/",
        "image": "/images/anaveragedayatthecatcafe.jpg"
    },
    "angrygranrun": {
        "about": "You must control angry gran and direct her through the streets of the town whilst avoiding the different objects scattered on the roads.",
        "controls": "AdVenture Capitalist offers simple game mechanics and one-tap controls, use your mouse to click buttons",
        "developer": "Ace Viral",
        "display_name": "Angry Granny Run",
        "iframe_url": "/gamefiles/angrygrannyrun/",
        "image": "/images/angrygranrun.avif"
    },
    "antarttycoon": {
        "about": "Ant Art Tycoon is an idle game by Wix Games where you manage a colony of artist ants and decide the price of each painting to maximize earnings. Avoid overpricement and undersell to earn money for better ants, colors, and canvases. You can also earn speed bonuses and other surprises to become the richest gallery owner.",
        "controls": "Buy - Left mouse button (or tap with your finger)",
        "developer": "Wix Games",
        "display_name": "Ant Art Tycoon",
        "iframe_url": "/gamefiles/antarttycoon/",
        "image": "/images/antarttycoon.avif"
    },
    "antwar": {
        "about": "AntWar.io is the strategy simulation game in which you are a single ant on a mission in the big wide world to colonize the land that lays in front of you. Start by making room for your colony by digging out dirt in the ground in front of you and placing eggs within them for more ants to hatch within.",
        "controls": "Press left mouse button to move, press twice to interact. Use the right mouse button on your ant to open command menu",
        "developer": "Bombsight Games",
        "display_name": "Antwar.io",
        "iframe_url": "/uv.html?site=https://antwar.io/",
        "image": "/images/antwario.png"
    },
    "appleknight": {
        "about": "Apple Knight is an action-platform role-playing game where players play as valiant heroes in a magical fantasy world. They must discover secrets, quests, pets, and valuable loot. They must defeat tough bosses using weapons, magical items, and spells. Players can upgrade their abilities, armor, pets, weapons, and spells, and enjoy the game in various difficulty settings.",
        "controls": "Move - WASD or Arrow keys, Jump - Z or J or Space, Attack - X or K or Control, Dash - V or ; or Alt, Throw apples - C or L or Shift",
        "developer": "Limitless LLC",
        "display_name": "Apple Knight",
        "iframe_url": "/gamefiles/appleknight/",
        "image": "/images/appleknight.avif"
    },
    "aquapark": {
        "about": "Try to be the first player to reach the pool at the bottom in this super addicting online game. Ride down the slide as you try to prove you are the fastest player out of the 15 challengers in this fun version of Aqua Park multiplayer game. Try to collect speed boosts, bump other players off of the side and attempt to be number one in each game.",
        "controls": "Controls displayed in game",
        "developer": "Voodoo",
        "display_name": "aquapark.io",
        "iframe_url": "/uv.html?site=https://aquapark.io",
        "image": "/images/aquaparkio.png"
    },
    "asmallworldcup": {
        "about": "A Small World Cup is a tiny but fun 2D soccer game. Choose your team and try to score into the opponents' goal.",
        "controls": "Drag and release to shoot.",
        "developer": "Rujo Games",
        "display_name": "A Small World Cup",
        "iframe_url": "/gamefiles/asmallworldcup/",
        "image": "/images/asmallworldcup.avif"
    },
    "awesometanks2": {
        "about": "Awesome Tanks 2 is a tank game where you battle against other tanks in a top-down 2D arena. Swerve tactically to take cover and fire your cannons to tear down enemy tanks! The fast-paced action is addictive.",
        "controls": "WASD or arrow keys to move, Left mouse button to shoot, Number keys to switch weapon",
        "developer": "Alexander Gette",
        "display_name": "Awesome Tanks 2",
        "iframe_url": "/gamefiles/awesometanks/",
        "image": "/images/awesometanks2.jpg"
    },
    "backrooms": {
        "about": "The Backrooms is a haunting story of being lost in empty rooms with fluorescent lights and a hum-buzz background. The protagonist must find a way out, but some friends may not want them to. If not awakened in time, their nightmares will drown them. The Backrooms is filled with old carpet, mono-yellow, and fluorescent lights, with approximately six hundred million square miles of randomly segmented empty rooms to be trapped in.",
        "controls": "WASD to mov... oh no, whats happening to me",
        "developer": "IEP Games",
        "display_name": "Backrooms",
        "iframe_url": "/gamefiles/backrooms/",
        "image": "/images/backrooms.png"
    },
    "baconmaydie": {
        "about": "Bacon May Die is a humorous game where a skilled pig battles hordes of enemies, using a gun if necessary. It can be played with two players on the same computer and can be played in 'coop' mode. Personalize your pig with various items, such as hats, glasses, necklaces, or pants, to make it cool. Bring your pet chicken, with its ferocious beak, to battle alongside your pig.",
        "controls": "Player 1: Move & fight - arrow keys, Shoot - press and hold left/right arrow. Player 2: Move & fight - WASD, Shoot - press and hold A/D",
        "developer": "SnoutUp Games",
        "display_name": "Bacon May Die",
        "iframe_url": "/gamefiles/baconmaydie/",
        "image": "/images/baconmaydie.webp"
    },
    "badeggio": {
        "about": "Bad Egg: Help your egg fight hordes of zombie chickens and get to the chopper!",
        "controls": "WASD to move",
        "developer": "Blue Wizard Digital",
        "display_name": "BadEgg.io",
        "iframe_url": "/uv.html?site=https://badegg.io/",
        "image": "/images/badeggio.png"
    },
    "badmondaysimulator": {
        "about": "Undergarf is where the characters of Garfield and Undertale combine. It's a carefree place, free of war and strife. Free of mondays! You play as Nermal, who stumbles upon this world and challenges Sansfield, the fusion of Sans and Garfield, to the ultimate duel.",
        "controls": "WASD to move, enter to interact/select",
        "developer": "Lumpy, Spasco on Itch.io",
        "display_name": "Bad Monday Simulator",
        "iframe_url": "/gamefiles/badmondaysimulator/",
        "image": "/images/badmondaysimulator.jpg"
    },
    "baldisbasics": {
        "about": "Baldi's Basics is a meta horror game with no educational value. Collect 7 notebooks and escape the school while avoiding Baldi. Learn how each character works and avoid their attention. Use items to your advantage and avoid getting quiz answers wrong, as each wrong answer makes Baldi angrier.",
        "controls": "Use the WASD keys to move, and the mouse to turn. Left click to open doors and pick up items, right click to use the currently selected item, and scroll wheel to change the currently selected item. Hold down shift to run (Keep an eye on your stamina bar!), and press space bar to quickly look behind you. Escape can be used to pause.",
        "developer": "Basically_Games",
        "display_name": "Baldi's Basics",
        "iframe_url": "/gamefiles/baldisbasics/baldi.html",
        "image": "/images/baldisbasics.png"
    },
    "banditrip": {
        "about": "Bandit.rip is an online multiplayer fighting game where players compete against other players using unique moves and costumes. With over 12 characters, players can unlock new skills and compete on the global leaderboard. The game offers various modes, maps, and allows players to level up, face rivals, and connect with in-game clans.",
        "controls": "A / D = move left and right, W / S = move up and down, Space = dash, E / Q = change weapon, T = chat, JKL or (use the mouse to attack)",
        "developer": "zetoman77",
        "display_name": "Bandit.RIP",
        "iframe_url": "/uv.html?site=https://bandit.rip/",
        "image": "/images/banditrip.webp"
    },
    "basketballstars": {
        "about": "Basketball Stars is a 2-player basketball game created by Madpuffers. You can play solo or with a friend as a variety of legendary basketball players. Shoot b-ball with the likes of LeBron James, James Harden, and Stephen Curry in Basketball Stars",
        "controls": "1 player controls: WASD or arrow keys to move, X/L to shoot/steal, S to pump/block, A+A or D+D or left/right arrow twice to dash, Z to super shot. 2 player controls: To move, player 1 use the WASD keys and player 2 use arrow keys, To pump, player 1 use S and player 2 use down arrow, To dash, player 1 use A/D twice and player 2 use left/right arrow twice, K to super shot",
        "developer": "MadPuffers",
        "display_name": "Basketball Stars",
        "iframe_url": "/gamefiles/basketballstars/",
        "image": "/images/basketballstars.avif"
    },
    "basketbros": {
        "about": "BasketBros is a fast-paced basketball game with online and offline gameplay. Choose a basketballer, customize your style, and compete in singleplayer and multiplayer games. Throw down some sick dunks and win the game to earn upgrades and unlockables.",
        "controls": "WASD + G. Arrows + L",
        "developer": "Blue Wizard Digital",
        "display_name": "Basketbros",
        "iframe_url": "/uv.html?site=https://basketbros.io/",
        "image": "/images/basketbros.jpg"
    },
    "basketrandom": {
        "about": "Basket Random is an awesome sports game where you beat opponents by gaining more points at each match. Throw balls into the opposing team's basket and win!",
        "controls": "Player 1: 'W' Player 2: 'UP ARROW KEY'",
        "developer": "RHM Interactive OÜ",
        "display_name": "Basket Random",
        "iframe_url": "/gamefiles/basketrandom/",
        "image": "/images/basketrandom.png"
    },
    "bigtowertinysquare": {
        "about": "Big Tower Tiny Square is a precision platformer created by Evil Objective. Dodge bullets and leap over lava pits as you make your way to the top of the tower to save your pineapple. Don’t ask why. Just keep jumping and dying (repeatedly) until you make it. Then breathe a sigh of relief.",
        "controls": "Movement: Arrow Keys / AD. Jump: spacebar / up arrow key / Z / W. Restart at last checkpoint: Y.",
        "developer": "Evil Objective",
        "display_name": "Big Tower Tiny Square",
        "iframe_url": "/gamefiles/bigtowertinysquare/",
        "image": "/images/bigtowertinysquare.png"
    },
    "bindingofisaac": {
        "about": "The Binding of Isaac is a roguelike dungeon crawler by Edmund McMillen and Florian Himsl, set in Isaac's basement. It features a procedurally generated environment with unique levels and enemies. Players collect items to escape their mother, improve Isaac's stats, abilities, or transform him into a different character. The game's replay value is enhanced by diverse items, ensuring a thrilling and engaging experience.",
        "controls": "Controls are displayed in game.",
        "developer": "Edmund McMillen and Florian Himsl",
        "display_name": "Binding of Isaac",
        "iframe_url": "/swf?notebook=bindingofissac",
        "image": "/images/bindingofisaac.jpg"
    },
    "bitlife": {
        "about": "Throughout the game, you'll need to manage various aspects of your life. If your happiness drops to low, you'll become depressed. Make bad food and drug choices, and your health can decline to dangerous levels. It's just like real life, but with way less risk:",
        "controls": "This is a simple game with the only controls being left-clicking the screen",
        "developer": "CandyWriter LLC",
        "display_name": "Bitlife",
        "iframe_url": "/gamefiles/bitlife/",
        "image": "/images/bitlife.png"
    },
    "blackout": {
        "about": "A witch on the roof of a scary old house. Black cats, cobwebs, and a crescent moon - all too creepy! In this point & click adventure, your task is to guide the main character Marilyn as she ventures deeper and deeper into a mysterious house in the middle of the night. Blackout is a straight forward point & click adventure. Investigate, navigate, and use items to interact with things in your environment.",
        "controls": "Point and Click",
        "developer": "FRESH on Itch.io",
        "display_name": "Blackout",
        "iframe_url": "/gamefiles/blackout/",
        "image": "/images/blackout.png"
    },
    "bloonstd1": {
        "about": "Bloons Tower Defense is a tower defense game where the goal is to keep those pesky balloons from flying out of your range. You'll have to pop them before you lose sight of them using darts, pins, and even bombs. You can plan your strategy before each wave, so make sure to use your time and money wisely.",
        "controls": "Click/tap the towers you'd like to build and click/tap on the area you want to put them. You can also click/tap the towers you've built to check any upgrades you can buy.",
        "developer": "Ninja Kiwi",
        "display_name": "Bloons TD 1",
        "iframe_url": "/swf?notebook=bloonstd1",
        "image": "/images/bloonstd1.png"
    },
    "bloonstd2": {
        "about": "Bloons Tower Defense 2 is a popular tower defense game originally released in Flash by Ninja Kiwi. Strategically place your defenses, upgrade your units, and stop all balloons from passing through.",
        "controls": "Click/tap the towers you'd like to build and click/tap on the area you want to put them. You can also click/tap the towers you've built to check any upgrades you can buy.",
        "developer": "Ninja Kiwi",
        "display_name": "Bloons TD 2",
        "iframe_url": "/swf?notebook=bloonstd2",
        "image": "/images/bloonstd2.jpg"
    },
    "bloonstd4": {
        "about": "Bloons Tower Defense 4 is a classic tower defense game initially released in Flash. Defend the path by placing various defenses tactically around the map. Upgrade them and unlock more as you get further through the game.",
        "controls": "Left mouse button",
        "developer": "Ninja Kiwi",
        "display_name": "Bloons TD 4",
        "iframe_url": "/gamefiles/bloonstd4/index.html",
        "image": "/images/bloonstd4.webp"
    },
    "bloxorz": {
        "about": "Can you master the logic of Bloxorz? Bloxorz is an addictive puzzle game that tests your logic and patience. The aim of the game is simple – you must direct the block into the hole. With 33 levels in total this game has great playability and will truly test your brain.",
        "controls": "Arrow keys to move the block.",
        "developer": "Damien Clarke",
        "display_name": "Bloxorz",
        "iframe_url": "/swf?notebook=bloxorz",
        "image": "/images/bloxorz.png"
    },
    "blumgi-slime": {
        "about": "Experience the world of Blumgi Slime as a jumping jelly with a mission to reach a goal using her jumps and physics skills. Observe your position and take necessary impulses to avoid falling into the void. Over 150 levels of simplicity and excitement await, with no overconfidence needed. Advance slowly and enjoy the challenge. Good luck!",
        "controls": "Click and hold",
        "developer": "Blumgi",
        "display_name": "Blumgi Slime",
        "iframe_url": "/gamefiles/blumgi-slime/",
        "image": "/images/blumgislime.avif"
    },
    "blumgirocket": {
        "about": "Blumgi Rocket is a platform game where players drive a rocket-fast car through colorful levels filled with obstacles. Experience the thrill of slow motion animation and power as you fire rockets. Perform stunts to finish levels quicker and impress fans. Unlock new vehicle skins by progressing through the game and completing every level. Master the game quickly to complete the game.",
        "controls": "Drive - W/S or Up/Down arrow keys, Rocket - Space bar",
        "developer": "Blumgi",
        "display_name": "Blumgi Rocket",
        "iframe_url": "/gamefiles/blumgirocket/",
        "image": "/images/blumgirocket.avif"
    },
    "bmxpark": {
        "about": "Play this amazing BMX Park simulation in a flash game! Try to get the highest score possible before the time runs out!",
        "controls": "Arrow keys = ride, Spacebar = jump , S = superman, A = backflip, D = tailwhip, F = nothing",
        "developer": "CBC Kids",
        "display_name": "BMX Park",
        "iframe_url": "/swf?notebook=bmxpark",
        "image": "/images/bmxpark.webp"
    },
    "brawlstarsfps": {
        "about": "Brawls once again staged a battle for crystals and now each of them will have to defend their position. Take control of one of the heroes and help to capture as many diamonds as possible. It will be quite difficult to do this because on the way there are armed enemies who shoot at everything that moves. Help Shelley, - that is the name of the main character, to win this confrontation.",
        "controls": "Control the hero - WASD or Arrow Keys, Fire - Left click",
        "developer": "Michael Rivera",
        "display_name": "Brawl Stars FPS",
        "iframe_url": "/gamefiles/brawlstarsfps/",
        "image": "/images/brawlstarsfps.png"
    },
    "breakingthebank": {
        "about": "Breaking the Bank is a stickman puzzle game made by Puffballs United, just as Infiltrating The Airship and Fleeing The Complex. Find the best way to Break the Bank!",
        "controls": "Use your mouse to play this game. Select actions, and make quick decisions!",
        "developer": "Puffballs United",
        "display_name": "Breaking the Bank",
        "iframe_url": "/swf?notebook=breakingthebank",
        "image": "/images/breakingthebank.avif"
    },
    "bronzeage": {
        "about": "Experience the Mesopotamian Middle East from 6000 BC to 2000 BC, leading your people through World History. Build infrastructure, manage the economy, and develop science and culture. Upgrade your army, keep borders safe, battle barbarians, and repel invaders. Build historically verified structures, houses, libraries, temples, and even the Great Pyramid. Make wise decisions to prevail or perish, and rule the legendary world of Mesopotamia.",
        "controls": "Controls displayed in game",
        "developer": "Desura",
        "display_name": "Bronze Age",
        "iframe_url": "/gamefiles/bronzeage/",
        "image": "/images/bronzeage.jpg"
    },
    "burgerandfrights": {
        "about": "It's a late night and you were craving burgers. It's time to ride home. Burger & Frights is a short horror game in which the player rides a bike throughout a dark forest. The game was inspired by games such as Rides with Strangers, and a certain horror movie by John Carpenter.",
        "controls": "The game is controlled using the mouse and keyboard. The full in depth control scheme is displayed ingame.",
        "developer": "Donitz",
        "display_name": "Burger and Frights",
        "iframe_url": "/gamefiles/burgerandfrights/",
        "image": "/images/burgerandfrights.jpg"
    },
    "burritobison3": {
        "about": "While Burrito Bison was quietly shopping at the local supermarket, a terrible boom suddenly resounded in the small Mexican town! All the town's bags of gummy bears exploded at the same time, releasing an army of living teddies ready to invade the world. Help our bison, along with his faithful friends El Pollo and Pineapple Spank, get rid of these vermin by flying as high and as far as possible to crush them all.",
        "controls": "Mouse = Navigate, Mouse Left = Select, Interact",
        "developer": "Kongregate Inc",
        "display_name": "Burrito Bison 3",
        "iframe_url": "/gamefiles/burritobison3/",
        "image": "/images/burritobison3.jpg"
    },
    "captivecentrifuge": {
        "about": " jump in, throw your arm to some bad guys' faces, and use your arm to push buttons (or just headbutt them!) to unlock doors!",
        "controls": "WASD to move. Left Mouse to throw arm. Space to jump. left alt to crouch. R to restart, L to quit.",
        "developer": "yeeticides on Itch.io",
        "display_name": "Captive Centrifuge",
        "iframe_url": "/gamefiles/captivecentrifuge/",
        "image": "/images/captivecentrifuge.webp"
    },
    "catninja": {
        "about": "As a cat on a quest to save the world by collecting crystals, you have your work cut out for you in a hostile realm full of lasers, land mines, spikes, sticky goo, and more... not to mention one of those trendy sassy narrators who mocks you when you fail. ",
        "controls": "WASD, space to jump & double jump",
        "developer": "TrackMill Gaming",
        "display_name": "Cat Ninja",
        "iframe_url": "/gamefiles/cat-ninja/",
        "image": "/images/catninja.png"
    },
    "cattrap": {
        "about": "Your objective is to trap the cat inside a box.",
        "controls": "Click to place a wall",
        "developer": "Llerah",
        "display_name": "Cat Trap",
        "iframe_url": "/gamefiles/cattrap/",
        "image": "/images/cattrap.png"
    },
    "cavegame": {
        "about": "Cavegame.io is an awesome game that takes inspiration from the legendary Minecraft. All you start with are a pickaxe and sword - you must move around the map and try to collect different resources so that you can survive.",
        "controls": "WASD to move, Left mouse button to attack/gather/place a block, Number keys to switch an item, Shift to sneak, E to open the crafting/shop menu",
        "developer": "Loonride",
        "display_name": "CaveGame.io",
        "iframe_url": "/uv.html?site=https://cavegame.io/",
        "image": "/images/cavegame.jpg"
    },
    "cavestory": {
        "about": "The main character wakes up in an underground cavern and discovers a village with Mimigas, rabbit-like creatures persecuted by the Doctor. Misery and Balrog abduct Toroko, a Mimiga named Sue. The player must rescue Sue, save the Mimigas, and escape the floating island. There are three endings: good (hard, difficult final stage), normal (normal), and bad (easy) based on the player's ability to find necessary items.",
        "controls": "Interact: Down, Jump: Z, Attack: X, Switch Weapons Left: A, Switch Weapons Right: S, Inventory: Q, Map System(When Obtained): W, Move: Arrow Keys Left/Right, Search: K/Down Arrow",
        "developer": "Nicalis, Studio Pixel, Variant Interactive.",
        "display_name": "Cave Story",
        "iframe_url": "/gamefiles/cavestory/",
        "image": "/images/cavestory.jpg"
    },
    "chesscom": {
        "about": "Chess.com is an internet chess server, news website and social networking website. The site has a freemium model in which some features are available for free, and others are available for accounts with subscriptions.",
        "controls": "Normal chess controls and also viewable on website",
        "developer": "Erik Allebest",
        "display_name": "chess.com",
        "iframe_url": "/uv.html?site=https://chess.com",
        "image": "/images/chesscom.png"
    },
    "clashofvikings": {
        "about": "Command your Vikings and destroy the enemy's base in Clash of Vikings, a new HTML5 battle game! The base is guarded by two towers which you need to destroy. Plan your strategy carefully by placing troop in the right positions. To summon troops, you need to have enough elixir. In each battle, you can bring eight different troops. Make sure to customize your deck to match your strategy. You can play aggressively or defensively... It's up to you!",
        "controls": "Use the left mouse button to drag troops into position.",
        "developer": "Anthony Rubbo.",
        "display_name": "Clash of Vikings",
        "iframe_url": "/gamefiles/clashofvikings/",
        "image": "/images/clashofvikings.png"
    },
    "clickhead": {
        "about": "CLICK ON YOUR OPPONENTS' HEADS IN CLICKHEAD THE HEADSHOT SIMULATwhat that was not the script I got the first time... ok can I speak to the previous guy...What, I'M rude?  It just clicked for me, I'm not made for this...",
        "controls": "Use mouse and WASD or arrow keys to play.",
        "developer": "Silvarc",
        "display_name": "Clickhead",
        "iframe_url": "/gamefiles/clickhead/",
        "image": "/images/clickhead.png"
    },
    "clustertruck": {
        "about": "A physics platformer where you jump and run from truck to truck to reach the end without falling off.",
        "controls": "Click Space/J - Jump,  Hold Space/J - Climb, Left Arrow/A - Move Left, Right Arrow/D - Move Right",
        "developer": "Landfall Games",
        "display_name": "Cluster Truck",
        "iframe_url": "/gamefiles/clustertruck/",
        "image": "/images/clustertruck.png"
    },
    "cookieclicker": {
        "about": "Cookie Clicker is an awesome idle clicker game with a baking theme. Bake cookies by clicking on a giant cookie. Use the collected cookies to buy upgrades. Which will get you even more cookies, and more, and more... you get the idea!",
        "controls": "Use the mouse to click the on-screen buttons and icons.",
        "developer": "Ortiel",
        "display_name": "Cookie Clicker",
        "iframe_url": "/gamefiles/cookieclicker/",
        "image": "/images/cookieclicker.png"
    },
    "crossingthepit": {
        "about": "Help Henry to cross the pit... Crossing The Pit is the game that started it all and eventually inspired Fleeing The Complex!",
        "controls": "Use your mouse to play this game. Select actions, and make quick decisions!",
        "developer": "Puffballs United",
        "display_name": "Crossing the Pit",
        "iframe_url": "/swf?notebook=crossingthepit",
        "image": "/images/crossingthepit.png"
    },
    "crossy-road": {
        "about": "Crossy Road is an arcade game created by Hipster Whale with the gameplay similar to the classic Frogger game. In Crossy Road you have to dodge traffic, hop across logs, sidestep trains and collect coins. Make sure you don’t stay still for too long or youre toast! Each Crossy Road game nets you coins which can be used to unlock exciting new characters..",
        "controls": "Use the arrow keys to move sideways or forward. Don't stand in the way of upcoming cars, or other incoming objects.",
        "developer": "Hipster Whale",
        "display_name": "Crossy Road",
        "iframe_url": "/gamefiles/crossy-road/index.html?world=original",
        "image": "/images/crossyroad.png"
    },
    "csgocaseclicker": {
        "about": "CaseClicker is an incremental clicker game based around csgo and the jackpot/skin community. The goal is to open cases and get rich.",
        "controls": "Your mouse",
        "developer": "Malthe",
        "display_name": "CSGO Case Clicker",
        "iframe_url": "/gamefiles/csgocaseclicker/",
        "image": "/images/csgocaseclicker.png"
    },
    "csgocaseclicker2": {
        "about": "CaseClicker is an incremental clicker game based around csgo and the jackpot/skin community. The goal is to open cases and get rich.",
        "controls": "Your mouse",
        "developer": "Malthe",
        "display_name": "CSGO Case Clicker 2",
        "iframe_url": "/gamefiles/csgocaseclicker2/",
        "image": "/images/csgocaseclicker2.png"
    },
    "cubefield": {
        "about": "Cubefield is a fast-paced endless running game that tests your ability to dodge obstacles at high speed. The challenge evolves as the levels progress, so stay alert and see how far you can travel in this endless field of cubes!",
        "controls": "Move left/right with left/right arrow key. Press P to pause.",
        "developer": "YoArcade",
        "display_name": "Cube Field",
        "iframe_url": "/gamefiles/cubefield/",
        "image": "/images/cubefield.webp"
    },
    "curveball": {
        "about": "Curveball is an excellent arcade game. Check it out here in your browser, free of charge. Can you get past level 7?",
        "controls": "Use the left mouse button to shoot",
        "developer": "engineering.com",
        "display_name": "Curve Ball",
        "iframe_url": "/swf?notebook=curveball",
        "image": "/images/curveball.jpg"
    },
    "curvefever": {
        "about": "The smash hit Curve Fever is back with a new multiplayer browser game: Curve Fever Pro. Cut off opponents, squeeze through tiny holes and unlock new powers.",
        "controls": "Left and right arrow keys to move. Up and down arrow keys to use abilities.",
        "developer": "Hidden Monster Games",
        "display_name": "Curve Fever",
        "iframe_url": "/uv.html?site=https://play.curvefever.pro/",
        "image": "/images/curvefeverpro.png"
    },
    "cuttherope": {
        "about": "Cut the rope to feed candy to the green monster! Om Nom is hungry for large pieces of candy. Your mission is to feed him as quickly as possible. You can collect stars in each level for bonus points. Slice every rope at the right time to win!",
        "controls": "Use the left mouse button to cut the rope or interact.",
        "developer": "ZeptoLab",
        "display_name": "Cut the Rope",
        "iframe_url": "/gamefiles/cuttherope/",
        "image": "/images/cuttherope.avif"
    },
    "danceoffireandice": {
        "about": "A Dance of Fire and Ice is a strict one-button rhythm game. You control two orbiting planets as they travel down a winding path.",
        "controls": "Click to the beat",
        "developer": "7th Beat Games",
        "display_name": "Dance of Fire and Ice",
        "iframe_url": "/gamefiles/danceoffireandice/",
        "image": "/images/danceoffireandice.png"
    },
    "day224": {
        "about": "Estimated playtime: 5 minutes, Submission for 'A DARK ROOM' Game Jam, revolving around the theme of 'One Room', The game was made in a span of a week, and roughly 45 hours. I'm pretty bad at dialogue writing and art, so forgive it's poor quality.",
        "controls": "Space to Interact, R to Restart, WASD or Arrow Keys to Move Up Down Left Right.",
        "developer": "Phamility",
        "display_name": "Day 224",
        "iframe_url": "/gamefiles/day224/",
        "image": "/images/day224.webp"
    },
    "debbiesdinerderby": {
        "about": "Welcome to Debbie's Diner - which also currently doubles as a roller derby! Complete your shifts quickly and cleanly, avoiding spills and customers to rack up as many stars as possible in all 20 levels of radical roller-skating mayhem!",
        "controls": "WASD/Arrow Keys - Move, Space/Shift - Brake / Use buttons in menus",
        "developer": "Team Bugulon",
        "display_name": "Debbie's Diner Derby",
        "iframe_url": "/gamefiles/debbiesdinerderby/",
        "image": "/images/debbiesdinerderby.png"
    },
    "deeeep": {
        "about": "Can you survive the terrors of Deeep.io? Deeeep.io is an addictive .io game where you play a marine creature trying to survive in the ruthless world of the sea. Harder than the shell of a crab, but more rewarding than catching your first fish.",
        "controls": "Wherever you point your mouse is where your animal will travel to. Animals that have the ability to walk across islands will jump to them if you click. When you're in the sea clicking will give a speed boost, as long as you have something in your boost bar. Animals that have special skills will perform these skills instead of speeding up when the boost bar has enough in it.",
        "developer": "Federico Mouse",
        "display_name": "Deeeep.io",
        "iframe_url": "/uv.html?site=deeeep.io",
        "image": "/images/deeeepio.jpg"
    },
    "defly": {
        "about": "Defly.io is an intriguing.io game where players fly helicopters and shoot other players. They can build towers and walls to mark their territory, earning experience points (XP). Players can also shoot helicopters' weapons to destroy enemies' territory and claim it for their own. Despite its standard.io gameplay, Defly.io offers a unique twist that sets it apart from other titles.",
        "controls": "WASD or arrow keys to move, Space bar to build a line, close the line to mark your territory, Left click to shoot (hold the mouse to shoot continuously), E or Shift to use superpower",
        "developer": "Exodragon Games",
        "display_name": "Defly.io",
        "iframe_url": "/uv.html?site=https://defly.io/",
        "image": "/images/deflyio.png"
    },
    "dinogame": {
        "about": "Dino Game is an endless runner game originally built into Google Chrome. The game was added as an easter egg to Google Chrome in 2014 to entertain users when there is no internet available. The game - nicknamed Chrome Dino - featuring a t-rex is played by over 270 million players every month. ",
        "controls": "You start the game by clicking the spacebar on your keyboard, on mobile tab the dino once. Avoid the obstacles by jumping over them using the spacebar or by tapping.",
        "developer": "Chrome UX",
        "display_name": "Dino Game",
        "iframe_url": "/gamefiles/dinogame/",
        "image": "/images/dinogame.avif"
    },
    "dogeminer2": {
        "about": "Doge Miner 2! The mission remains the same: to purchase a spaceship and blast off to the moon, but you now have an increase amount of tools, upgrades and options at your disposal. Doge Miner 2 builds upon the fun mechanisms and gameplay of the original title and adds extras features for your enjoyment.",
        "controls": "Left click to mine and buy upgrades.",
        "developer": "rkn",
        "display_name": "Doge Miner 2",
        "iframe_url": "/gamefiles/dogeminer2/",
        "image": "/images/dogeminer2.png"
    },
    "domeromantik": {
        "about": "Dome Romantik is a game where the hero, a stranger with a romantic nature, is sent to another planet to establish a base and research. He erects a dome and adapts to the alien's environment. The planet's surface is unsuitable for life, so the alien digs tunnels and goes deeper into the depths. The hero must expand and equip the base, fight underground monsters, and gather resources to survive.",
        "controls": "Use the arrows and the space bar in Dome Romantik to control.",
        "developer": "Bippinbits",
        "display_name": "Dome Romantik",
        "iframe_url": "/gamefiles/domeromantik/",
        "image": "/images/domeromantik.png"
    },
    "doom": {
        "about": "Doom is a first-person shooter game developed and published by id Software. Released on December 10, 1993, for DOS, it is the first installment in the Doom franchise. The player assumes the role of a space marine, popularly known as the Doomguy, fighting through hordes of undead humans and invading demons",
        "controls": "Control: Fire, hold Control down to fire rapidly. Arrow Keys: Move. Shift (held) while moving: Run. Alt (held) while moving: Strafe (move sideways) Period and Comma: Strafe (push instead of left and right arrow keys) Spacebar: Activate Switches, Open Doors etc.",
        "developer": "GT Interactive",
        "display_name": "Doom",
        "iframe_url": "/gba/launcher.html#dm",
        "image": "/images/doom.png"
    },
    "doomori": {
        "about": "Welcome to Whitespace. You've been living here for as long as you can remember. It's time for a change...",
        "controls": "Mouse",
        "developer": "Totally Fungal",
        "display_name": "Doomori",
        "iframe_url": "/gamefiles/doomori/",
        "image": "/images/doomori.png"
    },
    "doomori-2": {
        "about": "Prepare to rip, tear and slaughter everyone in your way through the sequel to the critically acclaimed Doomori. Featuring a full OST, beautiful art, and fast-paced, Doom inspired gameplay, Doomori Eternal is a funny and challenging experience.",
        "controls": "Arrow keys",
        "developer": "Totally Fungal",
        "display_name": "Doomori 2",
        "iframe_url": "/gamefiles/doomori2/",
        "image": "/images/doomori2.png"
    },
    "drifthunters": {
        "about": "Drift Hunters is a free-to-play 3D drifting game with an excellent selection of tracks and plenty of tuned-up cars. Pick your motor, tune it, then rev your engine and drift the turns in one of 10 unique locations!",
        "controls": "Use the WASD or arrows keys to steer the car, Use the space as the handbrake, Use C to change the camera position, Use left shift to shift up gears, Use left Ctrl to shift down gears",
        "developer": "Studionum43",
        "display_name": "Drift Hunters",
        "iframe_url": "/gamefiles/drifthunters/",
        "image": "/images/drifthunters.png"
    },
    "drivemad": {
        "about": "Drive Mad is a car game where you drive on a track filled with obstacles. Your aim is to reach the finish line in one piece. You have to balance your speed so your car doesn't flip over. This is harder than it sounds, as there are many thrilling and creative stunts and obstacles for you to enjoy. Do you have what it takes to finish every level in Drive Mad?",
        "controls": "Steer forward - W, D, X, Up arrow, Right arrow, Mouse click, Steer backward - S, A, Z, Down arrow, Left arrow",
        "developer": "Martin Magni",
        "display_name": "Drive Mad",
        "iframe_url": "/uv.html?site=https://play.fancade.com/5F084A0BCE06B710/",
        "image": "/images/drivemad.avif"
    },
    "ducklife1": {
        "about": "Duck Life is the first game in the Duck Life series. A tornado has struck your farm and destroyed everything. All that remains is a single duck egg. Train this duckling to peak athletic form so you can earn money to rebuild the farm.",
        "controls": "Running control: Use up arrow to jump. Flying controls: Use left and right arrow to move up and down. Swimming controls: Use up arrow to jump and down arrow to dive. Press left and right arrow to move left and right.",
        "developer": "Wix Games",
        "display_name": "Duck Life 1",
        "iframe_url": "/swf?notebook=ducklife1",
        "image": "/images/ducklife.avif"
    },
    "ducklife2": {
        "about": "Duck Life 2 is a duck racing game with various training levels to improve your athletic abilities. When you have trained enough, you enter a duck quadrathlon that puts your running, climbing, swimming, and flying skills to the test. Just another day in the life of a duck!",
        "controls": "Running controls: Use up arrow to jump. Flying controls: Use up and down arrow to change direction. Swimming controls: Use up arrow to jump and down arrow to dive. Press left and right arrow to move left and right. Climbing controls: Use left and right arrow to jump between each side of the canyon.",
        "developer": "Wix Games",
        "display_name": "Duck Life 2",
        "iframe_url": "/swf?notebook=ducklife2",
        "image": "/images/ducklife2.avif"
    },
    "ducklife3": {
        "about": "Duck Life 3 is a duck racing game featuring genetically modified ducks that evolve as you progress. Choose from one of four duck breeds and evolve as you complete each league. Like the previous game, training is essential to level up and improve your abilities.",
        "controls": "Running controls: Use up arrow to jump. Flying controls: Use up and down arrow to change direction. Swimming controls: Use up arrow to jump and down arrow to dive. Press left and right arrow to move left and right. Climbing controls: Use left and right arrow to jump between each side of the canyon.",
        "developer": "Wix Games",
        "display_name": "Duck Life 3",
        "iframe_url": "/swf?notebook=ducklife3",
        "image": "/images/ducklife3.avif"
    },
    "ducklife4": {
        "about": "Duck Life 4 is a duck racing game set after the ban on genetically modified ducks. A year has passed since the ban on genetically modified ducks and now it’s up to you to defeat the world champion. Train your duck team to compete in six new locations around the world.",
        "controls": "Speed program: Use left and right arrow to move the duck. Jump into the holes and stay on the screen. Endurance program: Use left and right arrow to move the duck. Try not to get hit by the falling objects. Reactions: 1234 to control your duck. Dodge the obstacles by pressing the corresponding number.",
        "developer": "Wix Games",
        "display_name": "Duck Life 4",
        "iframe_url": "/swf?notebook=ducklife4",
        "image": "/images/ducklife4.avif"
    },
    "ducklife5": {
        "about": "Make your duck and run through the caves on the right side of town. Collect coins, artifacts and treasure to upgrade your duck's abilities and make it as deep as you can!",
        "controls": "Click the left mouse button to make your duck fly.",
        "developer": "Zaratustra",
        "display_name": "Duck Life 5",
        "iframe_url": "/gamefiles/ducklife5/",
        "image": "/images/ducklife5.png"
    },
    "ducklife6": {
        "about": "Duck Life: Space is a duck racing game with a galactic story and theme. An alien from outer space has nabbed your trophy, and you need to go on a quest through space to get it back! Enjoy a plethora of new mini-games and races along the way.",
        "controls": "Left click to change side while running. Arrow keys to swim. Left and right arrow keys to move",
        "developer": "Wix Games",
        "display_name": "Duck Life 6",
        "iframe_url": "/gamefiles/ducklife6/",
        "image": "/images/ducklife6.png"
    },
    "dumbwaystodie": {
        "about": "The original edition of the Dumb Ways to Die series! Enjoy various fun challenges and mark your best score.",
        "controls": "Left mouse button",
        "developer": "Metro Trains",
        "display_name": "Dumb Ways to Die",
        "iframe_url": "/gamefiles/dumbwaystodie/",
        "image": "/images/dumbwaystodie.png"
    },
    "electricman2": {
        "about": "Electric Man 2 is an awesome stickman fighter Flash game in which you must fight against a range of opponents using a variety of different punch and kick combos. Before you enter the game, you can choose the name and color of your stickman, and also the difficulty level (easy, normal or pro). Once you have chosen your character you can then complete a tutorial that shows you the basic game mechanics and move sets.",
        "controls": "Arrow keys to move your character, Quick moves: A, S, D, Slow Motion moves: Q, W, E",
        "developer": " Damien Clarke",
        "display_name": "Electric Man 2",
        "iframe_url": "/swf?notebook=electricman2",
        "image": "/images/electricman2.png"
    },
    "endlesstruck": {
        "about": "Endless Truck is a free racing game. You're going to need monster skills to get behind the wheel of this monster truck and pull off monster stunts to score monster points and make monster cash. Endless Truck I an endless racer style game where you play and you race until you die.",
        "controls": "Press space bar to jump. Press left or right arrow to flip.",
        "developer": "LeapCloud",
        "display_name": "Endless Truck",
        "iframe_url": "/gamefiles/endlesstruck/",
        "image": "/images/endlesstruck.png"
    },
    "escapingtheprison": {
        "about": "Escaping The Prison is a fantastically fun stick figure game where you... Well, escape the prison! After being thrown in a prison cell, you must use anything and everything at your disposal to escape! Teleporters, anti-gravity equipment,toilet plungers,... Nothing is off limits in your attempt to escape! But be careful though, for one wrong move or slow reflexes could land you back in your cell... Or worse! Do you have what it takes to escape the prison?",
        "controls": "Use your mouse to play this game. Select actions, and make quick decisions!",
        "developer": "Puffballs United",
        "display_name": "Escaping the Prison",
        "iframe_url": "/swf?notebook=escapingtheprison",
        "image": "/images/escapingtheprison.avif"
    },
    "evoworld": {
        "about": "EvoWorld.io is a multiplayer survival game previously known as FlyOrDie.io. You start as a small fly and level up as you eat more food. As you evolve, other players become part of your diet too. Each level comes with a new special ability and more things to eat. The choice is simple, you Fly or Die!",
        "controls": "WASD to move around, Left click to fly",
        "developer": "Pixel Voices",
        "display_name": "Evoworld.io",
        "iframe_url": "/uv.html?site=https://evoworld.io/",
        "image": "/images/evoworld.avif"
    },
    "fancypants": {
        "about": "In this game you take control of Fancy Pants - a cool stickman character who wears awesome and colorful pants! You must help our fancy hero work his way through a myriad of cool levels and avoid various obstacles, monsters and creatures on his way!",
        "controls": "Left and right arrow to move, Up arrow to open doors, Down arrow to duck, S to jump, Space bar to pause the game",
        "developer": "Brad Borne",
        "display_name": "Fancy Pants",
        "iframe_url": "/swf?notebook=fancypants",
        "image": "/images/fancypants.avif"
    },
    "fireboywatergirl": {
        "about": "Fireboy and Watergirl 1 is the first cooperative platformer game in the Fireboy and Watergirl series. In this adventure, you explore 32 levels of the Forest Temple, controlling both the Fireboy and Watergirl characters through various puzzles.",
        "controls": "Fireboy Controls: Left and right arrow keys = move, Up arrow key = jump. Watergirl Controls: AD = move, Up arrow key = jump",
        "developer": "Oslo Albet",
        "display_name": "Fireboy and Watergirl",
        "iframe_url": "/gamefiles/fireboywatergirl/",
        "image": "/images/fireboywatergirl1.webp"
    },
    "fireboywatergirl2": {
        "about": "Fireboy and Watergirl 2: Light Temple is the second cooperative platformer game in the Fireboy and Watergirl series. In this adventure, use light and reflections to overcome puzzles. There is a total of 40 levels to conquer!",
        "controls": "Arrow keys to control Fireboy, WASD to control Watergirl",
        "developer": "Oslo Albet",
        "display_name": "Fireboy and Watergirl 2",
        "iframe_url": "/gamefiles/fireboywatergirl2/",
        "image": "/images/fireboywatergirl2.jpg"
    },
    "fireboywatergirl3": {
        "about": "Fireboy and Watergirl 3: Ice Temple is the third cooperative platformer game in the Fireboy and Watergirl series. Explore the freezing depths of the ice temple and slide your way through the tricky puzzles. Work together for the best results! There are 36 stages of increasing difficulty to master.",
        "controls": "Arrow keys to control Fireboy, WASD to control Watergirl",
        "developer": "Oslo Albet",
        "display_name": "Fireboy and Watergirl 3",
        "iframe_url": "/gamefiles/fireboywatergirl3/",
        "image": "/images/fireboywatergirl3.png"
    },
    "fireboywatergirl4": {
        "about": "Fireboy and Watergirl 4: Crystal Temple is the fourth installment in the cooperative platformer game series Fireboy and Watergirl. This adventure features the addition of teleportation crystals, along with all the fun and puzzling contraptions of the previous games. There are 38 levels to beat in total!",
        "controls": "Arrow keys to control Fireboy, WASD to control Watergirl",
        "developer": "Oslo Albet",
        "display_name": "Fireboy and Watergirl 4",
        "iframe_url": "/gamefiles/fireboywatergirl4/",
        "image": "/images/fireboywatergirl4.jpg"
    },
    "flappybird": {
        "about": "Fly through the pipes without crashing! This extremely addictive arcade game spawned a worldwide Flappy Bird craze. You must react quickly to glide through each set of pipes. Time each move perfectly to continue flying and set a high score!",
        "controls": "Click or space bar",
        "developer": "Dong Nguyen",
        "display_name": "Flappy Bird",
        "iframe_url": "/gamefiles/flappybird/",
        "image": "/images/flappybird.png"
    },
    "fleeingthecomplex": {
        "about": "You are trapped inside a small prison cell, and you have to escape not just your cell, but the whole prison! If you fail, death is awaiting you... Fleeing the Complex is an amazing stick figure escape game. The highly secured prison is guarded by some strong stick soldiers. You will have to make good and fast decisions to make it out alive. Good luck!",
        "controls": "The controls are simple. You're presented with a decision on the screen, then you click on the option, action or tool you'd like to use.",
        "developer": "Puffballs United",
        "display_name": "Fleeing the Complex",
        "iframe_url": "/swf?notebook=fleeingthecomplex",
        "image": "/images/fleeingthecomplex.webp"
    },
    "fliphero": {
        "about": "Flip Hero is a delightful bike racing IO game created by KasSanity. Compete against other players as you advance from level to level and see what sweet flips you can pull! The more you land, the more points you'll earn. But be careful! Crash and you'll fall behind your fellow racers. This fun, bright racing game is sure to get your adrenaline rushing!",
        "controls": "Press the space key to Flip/accelerate",
        "developer": "KasSanity",
        "display_name": "Flip Hero",
        "iframe_url": "/gamefiles/fliphero/",
        "image": "/images/fliphero.avif"
    },
    "fnaf": {
        "about": "The main series consists of nine survival horror video games taking place in locations connected to a fictional family pizza restaurant franchise named Freddy Fazbear's Pizza, after its mascot, the animatronic bear Freddy Fazbear.",
        "controls": "Click and drag with the mouse",
        "developer": "ScottGames",
        "display_name": "Five Nights at Freddy's",
        "iframe_url": "/gamefiles/fnaf/",
        "image": "/images/fnaf.png"
    },
    "fnaf2": {
        "about": "Players take on the role of a security guard who must survive the night shift at a fictional pizza restaurant without being attacked by the animatronic characters that wander through the building.",
        "controls": "Mouse controls",
        "developer": "Scottgames",
        "display_name": "Five Nights at Freddy's 2",
        "iframe_url": "/gamefiles/fnaf-2/",
        "image": "/images/fnaf2.png"
    },
    "footballlegends2021": {
        "about": "Football Legends 2021 introduces a super soccer journey with game modes and famous players. The game is available in single and two-player gaming modes, with Quick Match, Tournament, and Friends modes. The top scorer wins the game, and each character has a super shot power with a cooldown. The game features a variety of characters and modes, allowing players to engage in thrilling soccer matches.",
        "controls": "Left Mouse Button - Shoot Portals A W D - Move Q - Launch a Blue Portal E - Launch a Yellow Portal R - Close Portals F - Pick up an Object ~ - Open up Developer Console (Can be Enabled Through the Settings) O - Quick Quality Adjust Esc or P - Pause the Game",
        "developer": "We Create Stuff",
        "display_name": "Football Legends 2021",
        "iframe_url": "/gamefiles/football-legends-2021/",
        "image": "/images/footballlegends.avif"
    },
    "gdr": {
        "about": "Welcome all to Geometry Dash Remastered, and, well, you already know the game. But this is more, this is 5 new levels you can't find anywhere else, this is ... REMASTERED (I'm totally serious).",
        "controls": "Esc: Pause; Space bar/click: jump",
        "developer": "Arabask",
        "display_name": "Geometry Dash Remastered",
        "iframe_url": "/gamefiles/gdash/",
        "image": "/images/gdr.webp"
    },
    "getawayshootout": {
        "about": "In Getaway Shootout you race three others to the extraction point. This is no ordinary race however, as you can only jump your way to the finish line. Try out-jumping the computer, or one of your friends in this two-player game. On your obstacle filled way to the finish, you'll find all sorts of weaponry and boosts to beat the competition.",
        "controls": "W and I- jump left. E and O- jump right. R and P - power-up",
        "developer": "Neweich Games",
        "display_name": "Getaway Shootout",
        "iframe_url": "/gamefiles/getawayshootout/",
        "image": "/images/getawayshootout.png"
    },
    "gettingoverit": {
        "about": "Instead of a man in a pot navigating a punishing and surreal landscape, this playful alternative has you playing as a cat in a plant pot climbing various colorful blocks and giant fruits.",
        "controls": "Move your mouse to move the hammer",
        "developer": "Griffpatch",
        "display_name": "Getting Over It",
        "iframe_url": "/gamefiles/gettingoverit/",
        "image": "/images/gettingoverit.jpg"
    },
    "googlefeud": {
        "about": "Google Feud is a game where you have to guess the rest of a Google query. There are 10 answers for each question, presented in a quiz format similar to Family Feud. Just like the hit quiz show, you have 3 guesses, so use them wisely!",
        "controls": "Use your mouse and keyboard to play.",
        "developer": "Justin Hook",
        "display_name": "Google Feud",
        "iframe_url": "/gamefiles/googlefeud/",
        "image": "/images/googlefeud.jpg"
    },
    "gpopio": {
        "about": "Gpop.io is a competitive music game. Try to hit all the notes correctly while listening to beautiful songs.",
        "controls": "Press ASDF to hit the notes.",
        "developer": "cer0zz",
        "display_name": "gpop.io",
        "iframe_url": "/uv.html?site=https://gpop.io",
        "image": "/images/gpopio.webp"
    },
    "granny": {
        "about": "Granny keeps you locked in her house. Now you have to try to get out of her house, but be careful and quiet. She hears everything. If you drop something on the floor, she hears it and comes running. You can hide in wardrobes or under beds. You have 5 days.",
        "controls": "Controls displayed in game.",
        "developer": "Dvloper",
        "display_name": "Granny",
        "iframe_url": "/uv.html?site=https://now.gg/play/dvloper/4807/granny",
        "image": "/images/granny.webp"
    },
    "gunmayhem2": {
        "about": "The sequel to Gun Mayhem is finally here! This time with even more chaos. Defeat your powerful enemies by shooting them or blasting them off the platform with dynamite. This game has a single-player campaign mode, custom games, and a series of challenges. Once you have selected the game mode, you can customize the appearance, color, and loadout of your character – you can change their shirt, hat, and face, plus their perks and weapon.",
        "controls": "Click the controls menu in the game",
        "developer": "Kevin Gu ",
        "display_name": "Gun Mayhem 2",
        "iframe_url": "/swf?notebook=gunmayhem2",
        "image": "/images/gunmayhem2.png"
    },
    "gunnightio": {
        "about": "Gun Night is a fast-paced io type gunfighting game. Kill with one bullet and respawn instantly. Collect bullets by shooting others or find them on the map.",
        "controls": "WASD to Move, Left Click to Shoot",
        "developer": "TD2TL",
        "display_name": "Gun Night.io",
        "iframe_url": "/gamefiles/gunnightio/",
        "image": "/images/gunnightio.jpg"
    },
    "headsoccer": {
        "about": "Soccer Heads is a fun and entertaining soccer competition game with many different power-ups.",
        "controls": "use the A and D to move left and right, bounce the ball with your head",
        "developer": "D&D Dream Corp",
        "display_name": "Head Soccer",
        "iframe_url": "/gamefiles/headsoccer/",
        "image": "/images/headsoccer.png"
    },
    "hobo": {
        "about": "Hobo is the first instalment of this fun fighting game. You take control of a hobo and must fight your way through the streets! Don't let anyone boss you around or mistreat you - if they try to then use your super strength to punch and kick them into oblivion! Your hobo has a range of different fighting moves so try to use them all to defeat your enemies.",
        "controls": "Punch with A, pick up objects with A, kick with S, move with arrow keys, run by double-tapping left/right arrow key.",
        "developer": "Unknown",
        "display_name": "Hobo",
        "iframe_url": "/swf?notebook=hobo",
        "image": "/images/hobo.webp"
    },
    "holeio": {
        "about": "Carve a path of destruction through the city as an all-powerful black hole in Hole.io. Grow ever larger by consuming everything that stands in your way, whether it be garbage cans, fire hydrants or other players. As you grow, you’ll be able to eat even bigger objects until nothing is standing in your way! If your black hole is big enough, you can even consume other players’ black holes. Hole io is a super-fun game all about growing, eating and staying alive!",
        "controls": "To move use W/A/S/D, the arrow keys or your mouse cursor.",
        "developer": "Voodoo",
        "display_name": "Hole.io",
        "iframe_url": "/gamefiles/holeio/",
        "image": "/images/holeio.jpg"
    },
    "holeio2": {
        "about": "Hole.io 2 is a fun web-browser game about black holes eating everything in the cities. There are tons of questions asked by our players, some of them are answered here!",
        "controls": "Use your mouse to move the black hole.",
        "developer": "Kevin.Games",
        "display_name": "Hole.io 2",
        "iframe_url": "/uv.html?site=https://hole-io.com/",
        "image": "/images/holeio2.png"
    },
    "houseofhazards": {
        "about": "House of Hazards is a skill game by NewEichGames where players race to complete tasks in a flat while real-time opponents set up traps. To win, players must avoid obstacles and activate traps at the right time. The wheel of fortune at the end helps learn rules for the next round. House of Hazards is addictive and should come with a warning.",
        "controls": "Player 1: Move left - A, Move right - D, Jump - W, Crouch/Fire - S. Player 2: Move left - J, Move right - L, Jump - K, Crouch/Fire - I",
        "developer": "Neweich Games",
        "display_name": "House of Hazards",
        "iframe_url": "/gamefiles/houseofhazards/",
        "image": "/images/houseofhazards.png"
    },
    "idlebreakout": {
        "about": "Build the ultimate brick-busting machine to destroy billions of bricks. Idle breakout combines classic brick breaking with an insanely addicting idle loop.",
        "controls": "Mouse for clicking",
        "developer": "Kodiqi",
        "display_name": "Idle Breakout",
        "iframe_url": "/gamefiles/idlebreakout/",
        "image": "/images/idlebreakout.avif"
    },
    "impossiblequiz": {
        "about": "The Impossible Quiz is a classic brain teaser that will confuse you until your head hurts. This is the same puzzle game you may remember from your childhood. This is an online game that is full of twists and jokes that will get you frustrated but also make you laugh. Try to solve the entire quiz as quickly as you can. You can do it on your own or invite your friends to help you solve this crazy brain teaser.",
        "controls": "Click the on screen icons",
        "developer": "SPLAPP-ME-DO",
        "display_name": "Impossible Quiz",
        "iframe_url": "/swf?notebook=impossiblequiz",
        "image": "/images/impossiblequiz.avif"
    },
    "impossiblequiz2": {
        "about": "The Impossible Quiz 2 is the second installment of the hardest trivia quiz on the word wide web. Questions even got more tricky than in the first quiz, which makes this game officially the hardest one available. The creator Splapp-me-do has done everything to make sure you won't succeed in completing this quiz. 120 questions are waiting for you to be answered. Good luck!",
        "controls": "Use your mouse to answer the questions",
        "developer": "Splapp-me-do",
        "display_name": "Impossible Quiz 2",
        "iframe_url": "/swf?notebook=impossiblequiz2",
        "image": "/images/impossiblequiz2.avif"
    },
    "imposterio": {
        "about": "Become the best alien gladiator in Impostor.io. This action game combines the charm of Among Us with the fun of free for all deathmatch.",
        "controls": "You control your snake using your mouse or if you're on the iOS version, the screen. Your snake never stops moving, there is no 'pause' or 'stop' button, but there is autopilot. More information on that in the next section. To speed you may press 'Space' or 'Left-click'.",
        "developer": "Addicting Games Inc",
        "display_name": "Imposter.io",
        "iframe_url": "/uv.html?site=https://impostor.io/",
        "image": "/images/imposterio.webp"
    },
    "infiltratingtheairship": {
        "about": "Can you choose wisely and help the stickman in this game to accomplish his goals? Ralph the stickman is attempting to infiltrate a gigantic airship to capture the villainous Henry. You must use your intelligence to help him choose the correct course of action to ensure he succeeds.",
        "controls": "Use the left mouse button to make your choices.",
        "developer": "Puffballs United",
        "display_name": "Infiltrating the Airship",
        "iframe_url": "/swf?notebook=infiltratingtheairship",
        "image": "/images/infiltratingtheairship.png"
    },
    "jacksmith": {
        "about": "Craft weapons and armor to equip heroes on their adventure in Jacksmith. Manage time, work carefully, and discover secret recipes for the best gear. Accuracy is key to pleasing customers, so pay attention to every detail, from casting metal to putting a grip in the blade handle. Avoid cutting corners and prioritize accuracy over speed, as it will negatively impact your performance score.",
        "controls": "Point and Click",
        "developer": "Flipline Studios",
        "display_name": "Jacksmith",
        "iframe_url": "/swf?notebook=jacksmith",
        "image": "/images/jacksmith.png"
    },
    "janissarytower": {
        "about": "Janissary Tower is a 2-player tower battle game, just like Fortz. Your mission is to build a defense and destroy your opponent using the cannon.",
        "controls": "Player 1 Controls: AD to move, W to jump, S to place blocks, W and S to aim (using cannon), D to shoot (using cannon). Player 2 Controls: Left and right arrows to move, Up arrow to jump, Down arrow to place blocks, Up and down arrow to aim (using cannon), Left arrow to shoot (using cannon)",
        "developer": "RHM Interactive",
        "display_name": "Janissary Tower",
        "iframe_url": "/gamefiles/janissarytower/",
        "image": "/images/janissarytower.webp"
    },
    "jellytruck": {
        "about": "Drive your Jelly Truck across all the obstacles to complete each level. Can you complete all 20 levels?",
        "controls": "Use the up and down arrow keys to drive forward or backwards, and use the left or right arrow keys to tilt your truck. Drive your way through the jelly world and reach the finish line in each level. Don't get squashed!",
        "developer": "GameTornado",
        "display_name": "Jelly Truck",
        "iframe_url": "/gamefiles/jellytruck/",
        "image": "/images/jellytruck.png"
    },
    "jetpackjoyride": {
        "about": "Jetpack Joyride is an endless running game where Barry Steakfries races to beat scientists in a lab. Players use their fingers, left mouse button, or space bar to ascend and descend, collecting coins, power-ups, weapons, and stylish outfits. The game features bullet-powered jetpacks, mechanical dragons, and birds shooting money. Players can share the game with friends and compare high scores to maximize the fun.",
        "controls": "Hold down your finger, left mouse button, or the space bar to ascend, and let go to descend.",
        "developer": "Halfbrick Studios",
        "display_name": "Jetpack Joyride",
        "iframe_url": "/gamefiles/jetpackjoyride/",
        "image": "/images/jetpackjoyride.png"
    },
    "jklmfun": {
        "about": "Chill multiplayer minigames: trivia quiz, word, guessing, drawing games and more.",
        "controls": "Mouse and Keyboard, not specfied to each minigame",
        "developer": "Elisée",
        "display_name": "JKLM.FUN",
        "iframe_url": "/uv.html?site=https://jklm.fun/",
        "image": "/images/jklmfun.png"
    },
    "junonio": {
        "about": "Junon.io is a co-op space station survival game with a mission to build and defend your colony against the evil Empire. You start off by mining asteroids for ores, and you also need to maintain a supply of food, water, oxygen, fuel, and power to survive. Eventually, you will be able to automate production systems from farming, butchering corpses, to refilling turret ammo.",
        "controls": "WASD - to move, Number keys - change equip, Space bar/mouse click - use current equip, C - craft, I - inventory, R - rotate, E - interact, M - map, P - colony",
        "developer": "Lupy Games Ltd.",
        "display_name": "Junon.io",
        "iframe_url": "/uv.html?site=https://junon.io/",
        "image": "/images/junonio.png"
    },
    "killiceagebaby": {
        "about": "Kill the ice age baby adventure is a fun game that children all over the world play with their families and enhances a childs creativity and problem solving skills",
        "controls": "WASD to move, Space to jump, left click to interact, left shift to sprint",
        "developer": "Kypello",
        "display_name": "Kill the Ice Age Baby",
        "iframe_url": "/gamefiles/killiceagebaby/",
        "image": "/images/killtheiceagebaby.png"
    },
    "kirka": {
        "about": "Kirka.io is a multiplayer FPS game in the voxel world. Choose your loadout and participate in the Champions League to become the best player!",
        "controls": "WASD = move, Space = jump, Left-click = shoot, Right-click = aim, Shift = crouch, E = dash, 1, 2, 3 = switch weapons",
        "developer": "Pierre-Éli",
        "display_name": "Kirka.io",
        "iframe_url": "/uv.html?site=kirka.io",
        "image": "/images/kirkaio.jpg"
    },
    "lasttrainhome": {
        "about": "This is a short horror-adventure game about being stuck on a train.",
        "controls": "Arrow keys to move, X to interact",
        "developer": "hby on Itch.io",
        "display_name": "Last Train Home",
        "iframe_url": "/gamefiles/lasttrainhome/",
        "image": "/images/lasttrainhome.png"
    },
    "learntofly": {
        "about": "Learn to Fly is a free launch game. Start with a flightless bird. Then do some massive training, a handful of clever power ups, and soon, you're on a glide path to glory! Fly, Penguin, Fly!!",
        "controls": "arrow keys for flight control; otherwise, use the mouse",
        "developer": "Max Games",
        "display_name": "Learn to Fly",
        "iframe_url": "/swf?notebook=learntofly",
        "image": "/images/learntofly.png"
    },
    "legostarwars": {
        "about": "Lego Star Wars: The Video Game for the Game Boy Advance is a handheld version of Lego Star Wars: The Video Game. It was produced by Giant Interactive and developed by Griptonite Games. It has major differences in gameplay and content from the TT-developed version of the game, and it only has 14 levels. Its sequel was also made for the Game Boy Advance.",
        "controls": "Controls are displayed in game.",
        "developer": "Eidos Interactive",
        "display_name": "Lego Star Wars",
        "iframe_url": "/gba/launcher.html#lsw",
        "image": "/images/legostarwars.jpg"
    },
    "lineoff": {
        "about": "clean the dangerous line machine from ancient dust!",
        "controls": "WASD/arrow keys to move, spacebar/z/k to jump",
        "developer": "Kultisti",
        "display_name": "Lineoff",
        "iframe_url": "/gamefiles/lineoff/",
        "image": "/images/lineoff.png"
    },
    "littlealchemy": {
        "about": "In Little Alchemy you start with the basic elements of air, fire, and water and can create a whole bunch of new elements! Combine different ones and create more and more complex things. Can you discover all 560 elements?",
        "controls": "Use your mouse to play!",
        "developer": "Recloak",
        "display_name": "Little Alchemy",
        "iframe_url": "/gamefiles/littlealchemy/",
        "image": "/images/littlealchemy.png"
    },
    "littlealchemy2": {
        "about": "Little Alchemy 2 is an intuitive online crafting game developed by Recloak. The aim is to combine elements to create new ones. Start by mixing Earth, air, fire, and water to produce new elements. Discover over 700 items and unlock the recipes to time, matter, and the Universe!",
        "controls": "Left click to interact with the menu items, Left click and drag to select items from your inventory",
        "developer": "Recloak",
        "display_name": "Little Alchemy 2",
        "iframe_url": "/uv.html?site=https://littlealchemy2.com/",
        "image": "/images/littlealchemy2.avif"
    },
    "littlebigsnake": {
        "about": "Snake your way through the competition to complete missions, upgrade your skills and destroy other players. Devour nectar and energy left by opponents to increase your size, skills, and abilities. Smash your way up the food chain as you evolve into the ultimate Little Big Snake.",
        "controls": "Controls displayed in game",
        "developer": "Addicting Games Inc",
        "display_name": "Little Big Snake",
        "iframe_url": "/uv.html?site=https://littlebigsnake.com/",
        "image": "/images/littlebigsnake.png"
    },
    "lofiroom": {
        "about": "Lofi Room is a super fun music arcade game in which you are in your bedroom and are in the mood to play some funky music to jam to. The problem is that all of the music instruments are hidden in various place and you need to find all of them successfully. Once you have found them exercise your musical talent and play them all pitch perfect.",
        "controls": "QWER to play the instrument.",
        "developer": "Bearmask on Itch.io",
        "display_name": "LoFi Room",
        "iframe_url": "/gamefiles/lofi-room/",
        "image": "/images/lofiroom.png"
    },
    "lolbeans": {
        "about": "LOLBeans.io is a multiplayer racing game where you have to avoid obstacles. Race to the end of the obstacle course in battle-royale-style elimination gameplay. Move through the levels until you are the only bean left standing. If the game is not working try to reload.",
        "controls": "WASD or arrow keys to move, Space bar to jump",
        "developer": "Big Boss Dolphin",
        "display_name": "LOLBeans.io",
        "iframe_url": "/uv.html?site=https://lolbeans.io/",
        "image": "/images/lolbeans.png"
    },
    "lostgamer": {
        "about": "Test your gaming geography. See if you can pinpoint your location just by using your surroundings and knowledge.",
        "controls": "Controls displayed in game",
        "developer": "Unknown",
        "display_name": "LostGamer.io",
        "iframe_url": "/uv.html?site=https://lostgamer.io/",
        "image": "/images/lostgamer.jpg"
    },
    "madalinstuntcars2": {
        "about": "Madalin Stunt Cars 2 is a 3D stunt driving game featuring some of the worlds most powerful cars. Jump behind the wheel of your favorite automobile and race around one of the three expansive maps. You can invite your friends to play in any of the online multiplayer servers to share the high-octane thrill.",
        "controls": "Use the WASD keys or the arrow keys to drive your car, Press Shift to use nitro, Press R to restart the car's position",
        "developer": "Madalin Stanciu",
        "display_name": "Madalin Stunt Cars 2",
        "iframe_url": "/gamefiles/madalinstuntcars2/",
        "image": "/images/madalinstuntcars2.png"
    },
    "madnessaccelerant": {
        "about": "Thirty days to bring this together and it still comes down to the wire on Madness Day. We've poured everything we got into this game so hopefully you enjoy it and it runs ok on your computer! If it runs slow, Q toggles the quality.",
        "controls": "Controls displayed in game.",
        "developer": "Tom Fulp",
        "display_name": "Madness Accelerant",
        "iframe_url": "/swf?notebook=madnessaccelerant",
        "image": "/images/madnessaccelerant.webp"
    },
    "meatboy": {
        "about": "Meat Boy is an awesome platform game with interesting and fun gameplay. You must control meat boy and help him through a series of challenges and levels to save his princess! Use the left and right arrow keys to move your meat boy, and use the space bar or A key to jump. You must make your way through each level and reach your beloved princess at the end!",
        "controls": "Left and right arrow to move, Space bar or A to jump",
        "developer": "Jonathan McEntee and Edmund McMillen",
        "display_name": "Meat Boy",
        "iframe_url": "/swf?notebook=meatboy",
        "image": "/images/meatboy.jpg"
    },
    "minecraftclassic": {
        "about": "Minecraft Classic is an online version of the famous open-world sandbox building game. It is a remake of the original Minecraft and was released for its 10th anniversary by the developer Mojang. In the game, players can build in creative mode using 32 available blocks. The game has a multiplayer feature so you can play with up to 8 friends. This is NOT the official version of Minecraft",
        "controls": "WASD to move, Left-click to destroy / place blocks, Right-click to toggle build mode, Number keys to choose blocks, Enter to save the position, R to load the position, B to open blocks menu, T to chat, F to toggle fog",
        "developer": "Mojang",
        "display_name": "Minecraft Classic",
        "iframe_url": "/uv.html?site=https://classic.minecraft.net/",
        "image": "/images/minecraftclassic.jpeg"
    },
    "mobgio": {
        "about": "This battle royale isn't for the weak! How long can you outwit and outlast the other competitors in this thrilling io game? Stay alive for as long as you can while you search for guns, flamethrowers, and health kits. Just watch out for all the bullets and fire that will be flying out of your opponents’ weapons!",
        "controls": "Move with the help of their mouse. It is possible to attack with the left click of your mouse and you can move faster with the right click. You can use the scroll of your mouse in order to switch weapons.",
        "developer": "Justin Hook",
        "display_name": "Mobg.io",
        "iframe_url": "/gamefiles/mobgio/",
        "image": "/images/mobg.png"
    },
    "mobsinc": {
        "about": "Each monster employee of the company must follow these three rules : 1. Left-Click to attack. 2. Press Q / W / E to unleash your special skills once you unlock them. 3. If you disappoint the CEO 4 times, you will be fired. (and have to start a new game)",
        "controls": "1. Left-Click to attack. 2. Press Q / W / E to unleash your special skills once you unlock them.",
        "developer": "OVERBOY ツ",
        "display_name": "Mobs, Inc",
        "iframe_url": "/gamefiles/mobsinc/",
        "image": "/images/mobsinc.jpg"
    },
    "monarchies": {
        "about": "Monarchies.io is a multiplayer simulation game in which you become a queen honey bee who needs to command your workers to create a mighty army. You need to manage every aspect carefully, from gathering nectar to expanding the territory. Watch out for other bees and good luck!",
        "controls": "WASD or arrow keys or left mouse button to move or interact, Number keys to do actions",
        "developer": "Corey van Hoosen",
        "display_name": "Monarchies.io",
        "iframe_url": "/uv.html?site=https://monarchies.io/",
        "image": "/images/monarchies.png"
    },
    "monkeymart": {
        "about": "Monkey Mart is an idle/management game where you control a cute monkey character who is in charge of a supermarket.",
        "controls": "Arrow keys to move around.",
        "developer": "TinyDobbins",
        "display_name": "Monkey Mart",
        "iframe_url": "/gamefiles/monkeymart/",
        "image": "/images/monkeymart.avif"
    },
    "monstertracks": {
        "about": "Monster Tracks is a skill game requiring careful driving on treacherous paths with aerial movements. Avoid excessive maneuvers, adjust speed, and be aware of obstacles like spline bridges, pebbles, tree logs, windmills, ramps, and water bodies. Upgrade your vehicle's power, grip, and weight to tackle future challenges. Share Monster Tracks with friends and compare high scores.",
        "controls": "Steer forward - W, D, X, Up arrow, Right arrow, Mouse click. Steer backward - S, A, Z, Down arrow, Left arrow",
        "developer": "Martin Magni",
        "display_name": "Monster Tracks",
        "iframe_url": "/uv.html?site=https://play.fancade.com/60851784770864E1",
        "image": "/images/monstertracks.avif"
    },
    "moomooio": {
        "about": "MooMoo.io is a challenging.io game that involves gathering resources and building a village. Players collect wood and stones from trees and rocks, which are used to build walls and windmills. These structures protect resources and provide points. Fruit bushes provide food for HP restoration. Leveling up involves gathering resources and upgrading, but players must be cautious of hostile opponents.",
        "controls": "WASD or arrow keys to move, 1 to 9 keys or left click to select item/building, Left click or space to gather resource/hit other players, E to toggle auto-attack, Q to quick select food, X to lock rotation, R to ping minimap, C to add map marker, Enter to chat",
        "developer": "Sidney de Vries",
        "display_name": "MooMoo.io",
        "iframe_url": "/uv.html?site=https://moomoo.io/",
        "image": "/images/moomooio.png"
    },
    "motox3m": {
        "about": "Moto X3M is a time trial bike racing game featuring challenging obstacles. There are 22 levels, each of which poses a new challenge and provides the opportunity to perform wild stunts on your dirt bike. Equip your helmet, rev your engine, and race against the clock to the finish line!.",
        "controls": "Press the up arrow key to accelerate. Balance your bike with the left and right arrow keys. Break by pressing the down arrow key. Perform flips and other stunts to gain time. Don't crash",
        "developer": "MadPuffers",
        "display_name": "MotoX3M",
        "iframe_url": "/gamefiles/motox3m/",
        "image": "/images/motox3m.avif"
    },
    "motox3m2": {
        "about": "The sequel of the addictive and challenging motorcycle stunt game Moto X3M 2! New dangerous obstacles and new bikes for upgrades. Have your dose of adrenaline rush and unlock all the achievements and be on top of the leaderboard!",
        "controls": "Press the up arrow key to accelerate. Balance your bike with the left and right arrow keys. Break by pressing the down arrow key. Perform flips and other stunts to gain time. Don't crash",
        "developer": "Mad Puffers",
        "display_name": "MotoX3M 2",
        "iframe_url": "/gamefiles/motox3m2/",
        "image": "/images/motox3m2.jpg"
    },
    "motox3m3": {
        "about": "The third game of the addictive and challenging motorcycle stunt game Moto X3M 3! New dangerous obstacles and new bikes for upgrades. Have your dose of adrenaline rush and unlock all the achievements and be on top of the leaderboard!",
        "controls": "Press the up arrow key to accelerate. Balance your bike with the left and right arrow keys. Break by pressing the down arrow key. Perform flips and other stunts to gain time. Don't crash",
        "developer": "Mad Puffers",
        "display_name": "MotoX3M 3",
        "iframe_url": "/gamefiles/motox3m3/",
        "image": "/images/motox3m3.webp"
    },
    "motox3mspooky": {
        "about": "Moto X3M 6: Spooky Land is the spooky sixth installment of Moto X3M. Drive your motorbike through Halloween-themed tracks filled with obstacles and stunt opportunities. Get your bike through the trials quickly to earn more points!",
        "controls": "Press the up arrow key to accelerate. Balance your bike with the left and right arrow keys. Break by pressing the down arrow key. Perform flips and other stunts to gain time. Don't crash",
        "developer": "Mad Puffers",
        "display_name": "Moto X3M Spooky",
        "iframe_url": "/gamefiles/motox3mspooky/",
        "image": "/images/motox3mspooky.avif"
    },
    "motox3mwaterpark": {
        "about": "The theme of this title is a pool party. You encounter everything from the sunshine and waterslides to giant tubes and umbrellas. The beach setting is fantastic and the new levels really are fun to play. Can you show off your stunt skills and become a top Moto X3M racer?",
        "controls": "Press the up arrow key to accelerate. Balance your bike with the left and right arrow keys. Break by pressing the down arrow key. Perform flips and other stunts to gain time. Don't crash",
        "developer": "Mad Puffers",
        "display_name": "MotoX3M Pool Party",
        "iframe_url": "/gamefiles/motox3mwaterpark/",
        "image": "/images/motox3mpoolparty.avif"
    },
    "motox3mwinter": {
        "about": "In this installment of Moto X3M, you'll be venturing through an icy road packed with 15+ new levels. Do stunts, break records, and enjoy the scenery in this fuel-soaked winter wonderland!",
        "controls": "Press the up arrow key to accelerate. Balance your bike with the left and right arrow keys. Break by pressing the down arrow key. Perform flips and other stunts to gain time. Don't crash",
        "developer": "Mad Puffers",
        "display_name": "MotoX3M Winter",
        "iframe_url": "/gamefiles/motox3mwinter/",
        "image": "/images/motox3mwinter.avif"
    },
    "nealfun": {
        "about": "Fun creative website with many different minigames.",
        "controls": "Click on the different games to play",
        "developer": "Neal Agarwal",
        "display_name": "neal.fun",
        "iframe_url": "/uv.html?site=https://neal.fun",
        "image": "/images/nealfun.jpg"
    },
    "osu": {
        "about": "osu! is a fun rhythm game that can be played from your browsers directly on your pc, tablets, and mobile phone. osu! web is inspired by the great rhythm game Osu! ",
        "controls": "Use your mouse or fingers to tap a series of circles that appear on the screen.",
        "developer": "Dean Herbert",
        "display_name": "Osu",
        "iframe_url": "/uv.html?site=https://osu-web.com/",
        "image": "/images/osu.jpg"
    },
    "overgame": {
        "about": "OVERGAME is a breaking-the-4th-wall story-rich and funny meta game with a plot twist",
        "controls": "Left & Right Click",
        "developer": "OVERBOY ツ",
        "display_name": "Overgame",
        "iframe_url": "/gamefiles/overgame/",
        "image": "/images/overgame.png"
    },
    "ovo": {
        "about": "OvO is a fast-paced platformer where you use precise parkour and free running skills to complete each level. The levels feature increasingly tricky obstacles and you’ll need to do various jumps, slides, and dives to avoid them.",
        "controls": "Use arrow keys to move.",
        "developer": "Dedra Games",
        "display_name": "OvO",
        "iframe_url": "/uv.html?site=https://dedragames.com/games/ovo/1.4/",
        "image": "/images/ovo.png"
    },
    "papapizza": {
        "about": "Papa's Pizzeria is back! Thanks to Ruffle you can now play Papa's Pizzeria for free in your web browser once again. Papa has spontaneously left town, leaving you in charge of the pizzeria. It's on you to take orders, add pizza toppings, put them in the oven, and cut the pizzas! Work fast and make Papa Louie proud.",
        "controls": "Perform all actions with the mouse.",
        "developer": "Flipline Studios",
        "display_name": "Papa's Pizzaria",
        "iframe_url": "/swf?notebook=papapizza",
        "image": "/images/papaspizzeria.png"
    },
    "papasburgeria": {
        "about": "Papa has left you in charge of his prized burger-building establishment. You now have to take the orders, then fry and build the burgers! Be a good burger flipper and make Papa Louie proud.",
        "controls": "Left-click to interact with the items",
        "developer": "Flipline Studios",
        "display_name": "Papa's Burgeria",
        "iframe_url": "/gamefiles/papasburgeria/",
        "image": "/images/papasburgeria.png"
    },
    "paperio2": {
        "about": "Paper.io 2 is a real-time multiplayer .io game where you have to capture as much territory as possible. Paint the map in your own color to take over the Paper.io world! Look out for other players vying to claim your space.",
        "controls": "Use the WASD keys or the arrow keys or move your mouse to control your snake.",
        "developer": "Voodoo",
        "display_name": "Paper.io 2",
        "iframe_url": "/gamefiles/paperio/",
        "image": "/images/paperio2.avif"
    },
    "passwordgame": {
        "about": "The Password Game is a 2023 puzzle browser game developed by Neal Agarwal. Gameplay consists in creating a password that follows increasingly unusual and complicated rules.",
        "controls": "Use your Keyboard to type.",
        "developer": "Suraj Elapully",
        "display_name": "The Password Game",
        "iframe_url": "/uv.html?site=https://neal.fun/password-game/",
        "image": "/images/passwordgame.png"
    },
    "peacemakers1919": {
        "about": "A history game based on the Paris Peace Conference of 1919 where leaders of Allied Power met at Palace of Versailles to draw up a new map after World War I.",
        "controls": "Right click to paint with primary color, left click for secondary, Use hotkeys 1-7 for the side buttons.",
        "developer": "Borington",
        "display_name": "Peacemakers 1919",
        "iframe_url": "/gamefiles/peacemakers1919/",
        "image": "/images/peacemakers1919.png"
    },
    "penaltyshooters2": {
        "about": "Penalty Shooters 2 is a fun soccer game where you can pick your favorite team, try to win each match as you climb up the ranks, and win the League.",
        "controls": "Mouse, point and click",
        "developer": "Vladeta Marinkovic",
        "display_name": "Penalty Shooters 2",
        "iframe_url": "/gamefiles/penaltyshooters2/",
        "image": "/images/penaltyshooters2.png"
    },
    "pikesio": {
        "about": "You've got to fight for your right to knight in this exciting io game. Can you outwit and outlast your opponents while you do battle with your pike? Collect power-ups while you duel your opponents and avoid the edge of their steel.",
        "controls": "Move your mouse to move the stick",
        "developer": "Clown Games",
        "display_name": "Pikes.io",
        "iframe_url": "/gamefiles/pikesio/",
        "image": "/images/pikesio.png"
    },
    "pizzatower": {
        "about": "Pizza Tower is a 2D action platformer game developed by the Tour de Pizza. The game features retro-inspired graphics and gameplay, where players control a pizza delivery boy named Peppino, as he battles through a tower filled with crazy enemies and traps to deliver a pizza to a mysterious customer at the top.",
        "controls": "Arrow keys - Move/Ladder, Z - Jump, X- Charge, Up + Z - Highjump, Down while falling - Freefall",
        "developer": "Tour de Pizza",
        "display_name": "Pizza Tower",
        "iframe_url": "/gamefiles/pizzatower/",
        "image": "/images/pizzatower.png"
    },
    "planetlife": {
        "about": "In Planet Life you are born again as a planet. Being a planet in space can be very lonely, but fortunately there is life out there. Search the corners of the universe, for new friends, who will help you on your quest to become a happy little place to live. Manage your resources, and upgrade tools to advance.",
        "controls": "Mouse to interact",
        "developer": "Northplay",
        "display_name": "Planet Life",
        "iframe_url": "/gamefiles/planetlife/",
        "image": "/images/planetlife.png"
    },
    "plantdaddy": {
        "about": "plant daddy is a laid-back browser game about raising houseplants in your sunny apartment. Your plants grow in real time, water them, buy some furniture, and then close the tab and come back when you have a spare moment!",
        "controls": "Use your mouse to buy plants, guides are shown on screen.",
        "developer": "Brady Soglin",
        "display_name": "Plant Daddy",
        "iframe_url": "/gamefiles/plantdaddy/",
        "image": "/images/plantdaddy.png"
    },
    "pokemonblack": {
        "about": "Pokémon Black is an RPG strategy adventure game released in 2010 for the NDS. Players start in Nuvema Town with Professor Juniper's three Pokémon, Cheren and Bianca. They must choose wisely to become a Pokémon Master and defeat Team Plasma's plans to save Pokémon relationships. The objective is to capture all Pokémon in Unova Region and become the best trainer in the land.",
        "controls": "Click the controller/game button once loaded to display controls",
        "developer": "Game Freak",
        "display_name": "Pokemon Black",
        "iframe_url": "/gamefiles/pokemon-black/",
        "image": "/images/pokemonblack.jpg"
    },
    "pokemoncrystal": {
        "about": "Capture the three legendary dog Pokemons and get a chance to capture Ho-Oh and Lugia in one of the best Pokemon games in history – Pokemon Crystal! Meet up and fight with Eusine and defeat him to gain Suicune's respect in this awesome Pokemon RPG game.",
        "controls": "Click the controller/game button once loaded to display controls",
        "developer": "Game Freak",
        "display_name": "Pokemon Crystal",
        "iframe_url": "/gamefiles/pokemon-crystal/",
        "image": "/images/pokemoncrystal.jpg"
    },
    "pokemonemerald": {
        "about": "Travel throughout the world and capture legendary Pokemons in this best selling game boy advance game - Pokemon Emerald Version!",
        "controls": "Click the controller/game button once loaded to display controls",
        "developer": "Game Freak",
        "display_name": "Pokemon Emerald",
        "iframe_url": "/gba/launcher.html#pokemonemerald",
        "image": "/images/pokemonemerald.jpg"
    },
    "pokemonfirered": {
        "about": "Experience the original Pokemon generation and rivalry between Ash and Gray in Pokemon Fire Red Version, a GameBoy Advance remake of the GameBoy Color. The game features a storyline, mini-games, and a cool storyline, making it an exciting game for both adults and children. With added content and updated graphics, Pokemon Fire Red Version remains one of the best Pokemon games ever.",
        "controls": "Click the controller/game button once loaded to display controls",
        "developer": "Game Freak",
        "display_name": "Pokemon FireRed",
        "iframe_url": "/gba/launcher.html#pokemonred",
        "image": "/images/pokemonfirered.jpg"
    },
    "pokemongold": {
        "about": "Gather all the second generation Pokemons in one of the best Pokemon RPG game! Battle gym leaders and capture the legendary Ho-oh in Pokemon Gold! Explore the Johto region and interact with the people of the land and start your Pokemon adventure.",
        "controls": "Click the controller/game button once loaded to display controls",
        "developer": "Game Freak",
        "display_name": "Pokemon Gold",
        "iframe_url": "/gamefiles/pokemon-gold/",
        "image": "/images/pokemongold.jpg"
    },
    "pokemonleafgreen": {
        "about": "Revisit the past Pokemon games with enhanced graphics, smoother game-play, and new features in Pokemon Leaf Green. Use the power of nature and battle Team Rocket in Pokemon Leaf Green. Get into the tutorial mode and learn the basics and join dozens of mini-games.",
        "controls": "Click the controller/game button once loaded to display controls",
        "developer": "Game Freak",
        "display_name": "Pokemon LeafGreen",
        "iframe_url": "/gba/launcher.html#pokemongreen",
        "image": "/images/pokemonleafgreen.png"
    },
    "pokemonplatinum": {
        "about": "Fulfill your dreams of being a Pokémon master as you embark on another adventure in Sinnoh Region in Pokémon Platinum! Try to catch all Pokemon and collect all badges!",
        "controls": "Click the controller/game button once loaded to display controls",
        "developer": "Game Freak",
        "display_name": "Pokemon Platinum",
        "iframe_url": "/gamefiles/pokemon-platinum/",
        "image": "/images/pokemonplatinum.jpg"
    },
    "pokemonruby": {
        "about": "Pokémon Ruby Version and Pokémon Sapphire Version are 2002 role-playing video games developed by Game Freak, published by The Pokémon Company and Nintendo for the Game Boy Advance. They are the first installments in the third generation of the Pokémon video game series, also known as the advanced generation",
        "controls": "Controls are displayed in game.",
        "developer": "The Pokémon Company and Nintendo",
        "display_name": "Pokemon Ruby",
        "iframe_url": "/gba/launcher.html#pokemonruby",
        "image": "/images/pokemonruby.jpg"
    },
    "pokemonsapphire": {
        "about": "The third entry of the main series of Pokemon! Explore the Hoenn region together with Team Aquaa! Discover 150 new species of Pokemons and join Double Battles in Pokemon Sapphire! Get the chance to capture the legendary water Pokemon Kyogre in one epic battle!",
        "controls": "Click the controller/game button once loaded to display controls",
        "developer": "Game Freak",
        "display_name": "Pokemon Sapphire",
        "iframe_url": "/gba/launcher.html#pokemonsapphire",
        "image": "/images/pokemonsapphire.png"
    },
    "pokemonshowdown": {
        "about": "Pokemon Showdown, also often formatted as Pokemon Showdown!, is a web-based Pokemon battle simulator. It is free open source software and written in JavaScript and Node.js",
        "controls": "Controls displayed in game.",
        "developer": "Zarel",
        "display_name": "Pokemon Showdown",
        "iframe_url": "/uv.html?site=https://play.pokemonshowdown.com/",
        "image": "/images/pokemonshowdown.jpg"
    },
    "pokemonsilver": {
        "about": "Enter the world of Pokemon and meet all the second generation Pokemons in this awesome RPG game! Train your Pokemons and collect gym badges in Pokemon Silver! Explore the Johto region and capture all-new sets of Pokemons!",
        "controls": "Click the controller/game button once loaded to display controls",
        "developer": "Game Freak",
        "display_name": "Pokemon Silver",
        "iframe_url": "/gamefiles/pokemon-silver/",
        "image": "/images/pokemonsilver.jpg"
    },
    "pokeysshootout3": {
        "about": "Pokey is back yet again, and this time there is no dress code for each stage! Use gear and weapon combos in this crazed endless battle!",
        "controls": "Controls displayed in game",
        "developer": "Fancade",
        "display_name": "Pokeys Shootout 3",
        "iframe_url": "/uv.html?site=https://play.fancade.com/61489FECA36247AC",
        "image": "/images/pokeysshootout3.png"
    },
    "portalflash": {
        "about": "Portal: The Flash Version is a Flash game based on the plot and gameplay of Portal.",
        "controls": "Left Mouse Button - Shoot Portals A W D - Move Q - Launch a Blue Portal E - Launch a Yellow Portal R - Close Portals F - Pick up an Object ~ - Open up Developer Console (Can be Enabled Through the Settings) O - Quick Quality Adjust Esc or P - Pause the Game",
        "developer": "We Create Stuff",
        "display_name": "Portal: The Flash Version",
        "iframe_url": "/swf?notebook=portalflash",
        "image": "/images/portalflash.jpg"
    },
    "pvz": {
        "about": "Use your arsenal of 49 zombie-zapping plants — peashooters, wall-nuts, cherry bombs and more — to mulchify 26 types of zombies before they break down your door. Conquer all 50 levels of Adventure mode — through day, night, fog, in a swimming pool, on the rooftop and more.",
        "controls": "Click on the different games to play",
        "developer": "PopCap Games",
        "display_name": "Plants vs. Zombies",
        "iframe_url": "/gamefiles/pvz/",
        "image": "/images/plantsvszombies.jpg"
    },
    "quake": {
        "about": "Quake is a First-Person Shooter video game that was developed by id Software and published by GT Interactive Software. Quake was one of the first fully 3D First-person shooter games. It has its influences from Doom in terms of gameplay, design, and story. ",
        "controls": "Controls displayed in game.",
        "developer": "GT Interactive",
        "display_name": "Quake",
        "iframe_url": "/uv.html?site=https://www.netquake.io/quake",
        "image": "/images/quake.webp"
    },
    "qwop": {
        "about": "QWOP is a skill game where players control an athlete's leg movement to advance while avoiding falling. They use Q, W, O, and P keys to control the runner's thighs and calves. Resistance from gravity and inertia affects joint movement. The only challenge is to compete with oneself and show perseverance to win.",
        "controls": "Control the movement of the athlete's legs to make the character move forward while trying to avoid falling over only using the Q, W, O and P keys.",
        "developer": "Bennett Foddy",
        "display_name": "QWOP",
        "iframe_url": "/gamefiles/qwop/",
        "image": "/images/qwop.avif"
    },
    "rabbitsamurai": {
        "about": "Swing, collect carrots and save your friends! Your goal is to find and rescue little mice from the mousetrap at the wolf's lair in the green land. Embark on an epic adventure where you can showcase your ninja skills with the help of your grappling hook and agile movements. Launch yourself from the rocket ninja cannon, collect carrots and crystals, avoid dangerous spikes and save all your mice friends!",
        "controls": "Tap or hold down the left mouse button to use the grappling hook",
        "developer": "Mini Duck Games",
        "display_name": "Rabbit Samurai",
        "iframe_url": "/gamefiles/rabbitsamurai/",
        "image": "/images/rabbitsamurai.png"
    },
    "raftwars": {
        "about": "Raft Wars is the original version of this awesome game and the prequel to the popular Raft Wars 2. Simon and his brother have found hidden treasure on a deserted beach but evil and greedy pirates want to claim it for themselves! You must get on your raft and use your weapons to eliminate the pirates and keep the treasure safe!",
        "controls": "Aim and shoot with the mouse. If you're on mobile, simply tap the screen to send your shot flying in the direction and angle where you tapped. The strength of the shot is determined by how far from your player you tapped (the further you tapped, the stronger the shot).",
        "developer": "Martijn Kunst",
        "display_name": "Raft Wars",
        "iframe_url": "/swf?notebook=raftwars",
        "image": "/images/raftwars.avif"
    },
    "raftwars2": {
        "about": "Raft Wars 2 is the long awaited sequel to the amazing original title. You take control of a cute baby who has lost his treasure - a millionaire has built a waterpark over our heroes treasure and you want to fight your way through the park to regain it! ",
        "controls": "Move your mouse to control the shooting power, use the left mouse button to shoot.",
        "developer": "Martijn Kunst",
        "display_name": "Raft Wars 2",
        "iframe_url": "/swf?notebook=raftwars2",
        "image": "/images/raftwars2.avif"
    },
    "recoil": {
        "about": "A nasty virus has spread around the world. Tap to fire your antiviral arsenal. Destroy all germs!",
        "controls": "Controls displayed in game",
        "developer": "Fancade",
        "display_name": "Recoil",
        "iframe_url": "/uv.html?site=https://play.fancade.com/5E9F40DA7F9C9FA8",
        "image": "/images/recoil.png"
    },
    "retrobowl": {
        "about": " Are you ready to manage your dream team into victory? Be the boss of your NFL franchise, expand your roster, take care of your press duties to keep your team and fans happy. The endless ways to customize your team and strategy will ensure the game will never get repetitive or boring. You can even edit the name, jersey, or location of every player! With the help of the free agency, you can easily improve or rebuild your team to your liking.",
        "controls": "To navigate use the Mouse / Trackpad. To select use the LMB(left mouse button)",
        "developer": "New Star Games Ltd",
        "display_name": "Retro Bowl",
        "iframe_url": "/gamefiles/retrobowl/",
        "image": "/images/retrobowl.avif"
    },
    "riddleschool": {
        "about": "Riddle School is a fun game of mystery and puzzle solving and the first title in the Riddle School series. You are stuck in school in a boring class and you want to escape! You must interact with various objects in the classrooms and hallway and try to deceive and confuse the teachers and try to leave the school and your boring class! This game has a simple click interface, fun gameplay and challenging puzzles.",
        "controls": "Left click to interact with objects and characters",
        "developer": "JonBro",
        "display_name": "Riddle School",
        "iframe_url": "/swf?notebook=riddleschool",
        "image": "/images/riddleschool.png"
    },
    "riddleschool2": {
        "about": "A point-and-click adventure escape game where you help Phil Eggtree figure a way to escape his music class and the middle school altogether in this 2nd installment of Riddle school. This game is brought back to life by using ruffle flash emulator.",
        "controls": "Left click to interact with objects and characters",
        "developer": "JonBro",
        "display_name": "Riddle School 2",
        "iframe_url": "/swf?notebook=riddleschool2",
        "image": "/images/riddleschool2.png"
    },
    "riddleschool3": {
        "about": "Riddle School 3 is the third in a series of school escaping, boring classroom avoiding, point and click adventure games! In Riddle School 3, your mission is to help Phil escape the classroom and eventually the school. Simple right? Not so fast! Several key objects that you need to escape are scattered about the school and finding them is no easy task. Will you be able to escape the school or will it be more homework for you?",
        "controls": "Left click to interact with objects and characters",
        "developer": "JonBro",
        "display_name": "Riddle School 3",
        "iframe_url": "/swf?notebook=riddleschool3",
        "image": "/images/riddleschool3.png"
    },
    "riddleschool4": {
        "about": "In this point-and-click game you need to observe all the objects to know what are they and what they can be used for. But, when you try to do anything, Mr. Munch presses a secret button and throws you into a very deep lava field underneath the school. Maybe you need to choose the correct hidden action to prevent that? Or maybe the game is just trolling you? Can you unlock the secret menus after you complete the game?",
        "controls": "Left click to interact with objects and characters",
        "developer": "JonBro",
        "display_name": "Riddle School 4",
        "iframe_url": "/swf?notebook=riddleschool4",
        "image": "/images/riddleschool4pre.png"
    },
    "riddleschool5": {
        "about": "Riddle School is back with Riddle School 5! Take control of Phil once more in his epic quest to escape his captors; a group of aliens who threaten the very existence of Earth! Search the mysterious area where you are being held and use all of the objects you come across to help you put an end to their plans once and for all! Combine ordinary items into more useful tools and save planet Earth!",
        "controls": "Left click to interact with objects and characters",
        "developer": "JonBro",
        "display_name": "Riddle School 5",
        "iframe_url": "/swf?notebook=riddleschool5",
        "image": "/images/riddleschool5.png"
    },
    "riddletransfer1": {
        "about": "In Riddle Transfer, Phil is trapped in a mysterious facility after helping an alien friend. The game is an addicting point and click adventure where the main goal is to escape. Players must search for hidden items, combine them, and use tools to find them and bring Phil to safety. The story is intriguing, but the challenge remains to escape.",
        "controls": "Use your mouse to play this game.",
        "developer": "JonBro",
        "display_name": "Riddle Transfer 1",
        "iframe_url": "/swf?notebook=riddletransfer1",
        "image": "/images/riddletransfer.png"
    },
    "riddletransfer2": {
        "about": "Riddle Transfer 2 is the long-awaited solution to the unresolved cliffhanger of 5 years ago... The game will only make complete sense if you have played or seen the previous ones, so make sure to play the original Riddle Transfer first!",
        "controls": "Use your mouse to play this game.",
        "developer": "JonBro",
        "display_name": "Riddle Transfer 2",
        "iframe_url": "/swf?notebook=riddletransfer2",
        "image": "/images/riddletransfer2.png"
    },
    "roblox": {
        "about": "Roblox is an online game platform and game creation system developed by Roblox Corporation that allows users to program games and play games created by other users.",
        "controls": "In Game",
        "developer": "Roblox Corporation",
        "display_name": "Roblox",
        "iframe_url": "/uv.html?site=https://now.gg/play/roblox-corporation/5349/roblox",
        "image": "/images/roblox.jpg"
    },
    "rooftopsnipers": {
        "about": "Rooftop Snipers is a chaotic two-button two-player sniper game. Find a friend to play with, or practice by playing against the computer in this rage-inducing action game",
        "controls": "Player 1 Controls: W to jump, E to shoot. Player 2 Controls: I to jump, O to shoot",
        "developer": "Michael Eichler",
        "display_name": "Rooftop Snipers",
        "iframe_url": "/gamefiles/rooftop-snipers/",
        "image": "/images/rooftopsnipers.avif"
    },
    "run3": {
        "about": "Run 3 is an incredibly addicting, endless runner-type action/platforming game in which you play as a little grey alien. The little alien is trespassing in an architecturally challenged area that is floating in space.",
        "controls": "Use space or the up arrow to jump. Use A or the left arrow to go left. Use D or the right arrow to go right",
        "developer": "Joseph Cloutier",
        "display_name": "Run 3",
        "iframe_url": "/gamefiles/run3/",
        "image": "/images/run3.avif"
    },
    "rythmplus": {
        "about": "Drop down VSRG rhythm music game made using Vue.js and canvas (WIP)",
        "controls": "Controls displayed in game.",
        "developer": "henryzt",
        "display_name": "Rythym Plus",
        "iframe_url": "/uv.html?site=https://rhythm-plus.com/",
        "image": "/images/rhythmplus.png"
    },
    "sandspiel": {
        "about": "Sandspiel is a falling sand game that provides a relaxing and creative place to play with elements like sand, water, plant, and fire.",
        "controls": "Left Click",
        "developer": "Maxbittker",
        "display_name": "Sandspiel",
        "iframe_url": "/gamefiles/sandspiel/",
        "image": "/images/sandspiel.png"
    },
    "sansfight": {
        "about": "Do you wanna have a bad time? 'cause if you play this game... you are REALLY not going to like what happens next. Play sans fight here!",
        "controls": "Arrow keys",
        "developer": "Unknown",
        "display_name": "Sans Fight",
        "iframe_url": "/gamefiles/sansfight/",
        "image": "/images/sansfight.png"
    },
    "shellshockers": {
        "about": "Shell Shockers (Shellshock.io) is a multiplayer .io FPS game featuring eggs armed with guns. You control one of these weapon-wielding eggs in one of four online game modes where the aim is to shatter your opponents with bullets and bombs. It's the ultimate online egg shooting game!",
        "controls": "WASD to move, Left-click to shoot, E to change weapon, Q to throw a grenade, R to reload, Space to jump, Shift to zoom and aim",
        "developer": "Blue Wizard Digital",
        "display_name": "Shell Shockers",
        "iframe_url": "/uv.html?site=https://shellshock.io/",
        "image": "/images/shellshockers.avif"
    },
    "skribbl": {
        "about": "Skribbl.io is a top multiplayer drawing game,If you enjoy games such as Pictionary, you will have so much fun playing this multiplayer drawing game. In this title, users must battle against each other using drawings and their own knowledge. Whilst playing this game, users take it in turns to drawn objects and try to guess them.",
        "controls": "Use the left mouse button to draw and the keyboard to give your guesses.",
        "developer": "Ticedev",
        "display_name": "Skribbl.io",
        "iframe_url": "/uv.html?site=https://skribbl.io",
        "image": "/images/skribblio.png"
    },
    "slither": {
        "about": "Slither.io is a popular .io snake game. You must grow your snake by consuming multi-colored orbs in a giant multiplayer arena. Avoid other snakes to avoid becoming snake food, or take other players down by forcing them to crash into your side.",
        "controls": "Mouse: Move your cursor to control the direction of your snake. Click to go at full speed.",
        "developer": "Steve Howse",
        "display_name": "Slither.io",
        "iframe_url": "/uv.html?site=https://slither.io/",
        "image": "/images/slitherio.jpg"
    },
    "slope": {
        "about": "Your task in Slope is to control the ball through the obstacles, avoid touching the red walls at constant speed. There will be a lot of effects while controlling the gravity ball. You need to be quick and quick to control the ball to avoid collisions or to fall into deep, otherwise you will lose.",
        "controls": "Use the left arrow to move left. Use the right arrow to move right",
        "developer": "Joseph Cloutier",
        "display_name": "Slope",
        "iframe_url": "/gamefiles/slope/",
        "image": "/images/slope.jpg"
    },
    "slope2": {
        "about": "Slope 2 Unblocked is a fun, never-ending platformer game. This game is the classic, fast-paced, slope tunnel game. At first, the game seems simple, but it is a challenge in disguise. This is a simple, but fun game. Even though the graphics of the game may be not the best, (as represented by the neon-lined look) the game is still very enjoyable.",
        "controls": "Left arrow = Move Left, Right arrow = Move Right",
        "developer": "Unknown",
        "display_name": "Slope 2",
        "iframe_url": "/gamefiles/slope2/",
        "image": "/images/slope2.jpg"
    },
    "slowroads": {
        "about": "Slowroads.io is a unique racing simulator that deconstructs and elevates traditional formulas. With no specific goals, players can relax and enjoy driving on an infinite road. They can travel at a steady pace or push the pedal to stay on course. The game offers multiple quality-of-life features, allowing players to explore diverse natural zones and picturesque landscapes for hours on end.",
        "controls": "WASD to drive, Q and E to change setting, C to change camera, F to toggle auto drive.",
        "developer": "anslo",
        "display_name": "slow roads",
        "iframe_url": "/uv.html?site=https://slowroads.io/",
        "image": "/images/slowroads.png"
    },
    "snowrider3d": {
        "about": "Snow Rider 3D is a great online game where you'll be sledding. It's a 3D game, so you’ll really feel as if you’re a part of it all. The goal will be to avoid obstacles and collect all of the presents. Since the obstacles are all over the place, you need to be real careful while sledding. When you manage to get enough gifts, you can buy a new sleight in the store. So come on, start playing!",
        "controls": "Press the left arrow to go left. Press the right arrow to go right. Press the up arrow to jump.",
        "developer": "New Gamer",
        "display_name": "Snow Rider 3D",
        "iframe_url": "/gamefiles/snowrider3d/",
        "image": "/images/snowrider3d.png"
    },
    "solitaire": {
        "about": "Celebrating over 30 Years of FUN. Join millions of gamers worldwide in one of the most played video games! Discover favorite Solitaire card games in one app; Klondike Solitaire, Spider Solitaire, FreeCell Solitaire, TriPeaks Solitaire and Pyramid Solitaire! Simple rules and straightforward gameplay make Microsoft Solitaire Collection fun for players age 8 to 108. Relax with the classics, enjoy keeping your mind sharp, or challenge yourself with features like Collections, Daily Challenges, Events and Rewards. Unlock over 75 Achievements to test your Solitaire skills and achieve a higher Gamerscore. With so many ways to play, the choice is up to you!",
        "controls": "Use your mouse to play!",
        "developer": "Microsoft Corporation",
        "display_name": "Microsoft Solitaire Collection",
        "iframe_url": "/gamefiles/solitaire/",
        "image": "/images/solitaire.png"
    },
    "sonicadvance3": {
        "about": "Sonic Advance 3 is a popular Sonic game for Game Boy Advance, featuring five main characters: Sonic, Knuckles, Cream, Tails, and Amy. Players must collect rings, avoid hits, and reach the finish line quickly to earn points. The game follows the story of Sonic Battle and features music and sound effects, as well as a unique tag mechanic.",
        "controls": "Click inside the screen to activate the controls menu.",
        "developer": "SEGA",
        "display_name": "Sonic Advance 3",
        "iframe_url": "/gba/launcher.html#sonic_advance3",
        "image": "/images/sonicadvance3.jpg"
    },
    "sortthecourt": {
        "about": "You are the King (or queen!) of a small medieval town - your job is simple - keep your citizens happy and improve their quality of life. As King, people from each corner of your town visit you on a daily basis and ask for your advice and assistance - it is up to you if you help these people or turn them away! Who deserves help the most? Which acts of kindness will boost your population, gold and citizens happiness?",
        "controls": "Use Y or N to choose an option.",
        "developer": "Graeme Borland",
        "display_name": "Sort the Court",
        "iframe_url": "/gamefiles/sortthecourt/",
        "image": "/images/sortthecourt.jpg"
    },
    "stabfishio": {
        "about": "Stabfish.io is a free io game where you play as a deadly oceanic beast. Join a multiplayer arena of fish equipped with fatal tusks and take down your share of prey while avoiding the sharp end of another player’s stabber. Collect the fish like trophies, eat food for boosts, and dominate the sea.",
        "controls": "Move your mouse to control the movement, Press left mouse button to boost speed",
        "developer": "Zytech AI",
        "display_name": "Stabfish.io",
        "iframe_url": "/uv.html?site=https://stabfish.io/",
        "image": "/images/stabfish.png"
    },
    "stabfishio2": {
        "about": "Stabfish 2 is the sequel of Stabfish.io, a shark fighting arena .io game. Battle other sharks in an online arena and impale as many as you can. This second installment features new sharks, abilities, loot, and much more.",
        "controls": "Move your mouse to control the movement, Press left mouse button to boost speed",
        "developer": "Zytech AI",
        "display_name": "Stabfish.io 2",
        "iframe_url": "/uv.html?site=https://stabfish2.io/",
        "image": "/images/stabfish2.jpg"
    },
    "starblast": {
        "about": "Starblast is a fun, fast paced online multiplayer arcade space shooter. Take control of your spaceship, mine asteroids, increase your stats, upgrade to different types of spaceships with improved stats and weapons.",
        "controls": "The controls in Starblast are fairly simple. The ship can either be controlled with the mouse or keyboard. Moving your mouse around along with pressing right-click or using the arrow keys will cause your ship to move while pressing left click on your mouse or the space bar on your keyboard will cause your ship to fire its weapons.",
        "developer": "Neuronality",
        "display_name": "StarBlast.io",
        "iframe_url": "/uv.html?site=starblast.io",
        "image": "/images/starblast.jpg"
    },
    "stealingthediamond": {
        "about": "Stealing The Diamond is a stick figure adventure game where players must steal a large diamond. They must choose between risking everything or sneaking to the prize. One wrong move can result in losing the diamond and potentially losing the game. The game challenges players to determine if they have the skills to successfully complete the heist.",
        "controls": "Use your mouse to play this game. Select actions, and make quick decisions!",
        "developer": "Puffballs United",
        "display_name": "Stealing the Diamond",
        "iframe_url": "/swf?notebook=stealingthediamond",
        "image": "/images/stealingthediamond.jpg"
    },
    "stickmanhook": {
        "about": "Stickman Hook is a skill game where you play as a swinging stickman through hundreds of challenging levels. This fun, colorful stickman game offers over 100 challenging levels. Unlock unique characters along the way to switch things up while you swing. Pay attention to the angle and direction of your swing to make it to the finish line! Can you control your swing?",
        "controls": "Hold space/left click to swing",
        "developer": "rkn",
        "display_name": "Stickman Hook",
        "iframe_url": "/gamefiles/stickmanhook/",
        "image": "/images/stickmanhook.avif"
    },
    "strandedonaraft": {
        "about": "Stranded on a Raft is a survival game where the player finds themselves alone on a small raft in the middle of the ocean. The goal is to collect resources, make tools and shelter, and try to survive as long as possible while avoiding dangers like sharks and hunger.",
        "controls": "WASD - Player movement, Right Click - Place blocks,Left Click - Interact tools (like fishing rods and spears) and to eat food, E - Opens inventory menu, C - Opens crafting menu, ESC - Opens save menu",
        "developer": "Rinexus Games",
        "display_name": "Stranded on a Raft",
        "iframe_url": "/gamefiles/strandedonaraft/",
        "image": "/images/strandedonaraft.png"
    },
    "subwaysurfers": {
        "about": "Subway Surfers is a classic endless runner game where Jake navigates subways to escape Inspector and his dog. Players collect coins to unlock power-ups, special gear, and customize characters and boards. Earn keys for unlocking characters and hoverboards, and complete daily Word Hunts and missions to earn rewards. Created by Kiloo and Sybo in 2012, Subway Surfers remains a popular online game.",
        "controls": "Use the left/right arrow to move left/right. Use the up arrow to jump. Use the down arrow to roll. Use space to activate hoverboard",
        "developer": "Sybo Games",
        "display_name": "Subway Surfers",
        "iframe_url": "/gamefiles/subwaysurfers/",
        "image": "/images/subwaysurfers.png"
    },
    "sugarsugar": {
        "about": "Sugar, Sugar is a simulation game created by Bart Bonte. Solve puzzles by sifting the sugar into coffee cups! Your job is to draw bridges and well-placed lines to capture each grain. Every level will have a new, sweet challenge, and the obstacles get harder as the game progresses. Concentrate to reach every granular objective!",
        "controls": "Use your left mouse button or finger to draw a line, and fill up the cups.",
        "developer": "JonBro",
        "display_name": "Sugar Sugar",
        "iframe_url": "/gamefiles/sugarsugar/?swf=sugarsugar.swf",
        "image": "/images/sugarsugar.avif"
    },
    "sugarsugar2": {
        "about": "Sugar, Sugar 2 is a simulation game created by Bart Bonte. Solve puzzles by sifting the sugar into coffee cups! Your job is to draw bridges and well-placed lines to capture each grain. Every level will have a new, sweet challenge, and the obstacles get harder as the game progresses. Concentrate to reach every granular objective!",
        "controls": "Drag left mouse button",
        "developer": "JonBro",
        "display_name": "Sugar Sugar 2",
        "iframe_url": "/gamefiles/sugarsugar/?swf=sugarsugar2.swf",
        "image": "/images/sugarsugar2.png"
    },
    "sugarsugar3": {
        "about": "Sugar, Sugar 3 is a simulation game created by Bart Bonte. Solve puzzles by sifting the sugar into coffee cups! Your job is to draw bridges and well-placed lines to capture each grain. Every level will have a new, sweet challenge, and the obstacles get harder as the game progresses. Concentrate to reach every granular objective!",
        "controls": "Drag left mouse button",
        "developer": "JonBro",
        "display_name": "Sugar Sugar 3",
        "iframe_url": "/gamefiles/sugarsugar/?swf=sugarsugar3.swf",
        "image": "/images/sugarsugar3.avif"
    },
    "sugarsugar4": {
        "about": "Sugar, Sugar: The Christmas Special is a winter-themed puzzle game by Bart Bonte, where players fill cups with sugar by drawing lines to guide physics-based flackes. The falling sweets must be able to slide down, adjusting gravity to ensure they don't squandered on the floor and find their way into a drink like mulled wine. Enjoy this festive and sugary puzzle game for a festive holiday experience.",
        "controls": "Drag left mouse button",
        "developer": "JonBro",
        "display_name": "Sugar Sugar Christmas",
        "iframe_url": "/gamefiles/sugarsugar/?swf=sugarsugar4.swf",
        "image": "/images/sugarsugarchristmas.png"
    },
    "superautopets": {
        "about": "Battle against other players at your own pace in this free to play chill auto battler. In Super Auto Pets you build a team from a lovable cast of animals who will fight for you. They each have unique abilites, so choose wisely who will join your team!",
        "controls": "Click  with the left mouse button on the icons on the screen",
        "developer": "Team Wood Games",
        "display_name": "Super Auto Pets",
        "iframe_url": "/gamefiles/superautopets/",
        "image": "/images/superautopets.jpg"
    },
    "superhot": {
        "about": "SUPERHOT Prototype is a first-person shooter game where time moves. Players shoot and move to see bullets fly off, while standing still stops them from moving. They must dodge enemy fire and use their limited bullets to progress. The game features five levels, and the final boss is the ultimate challenge.",
        "controls": "Move using WASD, shoot with a left mouse click",
        "developer": "SUPERHOT Team",
        "display_name": "Super Hot",
        "iframe_url": "/gamefiles/superhot/",
        "image": "/images/superhot.avif"
    },
    "superhotlinemiamideluxe": {
        "about": "You play as QA-Bot1986, a weapon quality assurance robot working for a big and shady corporation called SHOOTOUT INC. An unexpected glitch occured during your manufacturing, giving your cyber brain the ability to process data at 5861% higher speed than ordinary bots, allowing you to alter your perception of time and make it advance only when you move.",
        "controls": "WASD to move, mouse to aim, left click to shoot, right click to pick up gun",
        "developer": "Albatr on Itch.io",
        "display_name": "Superhotline Miami Deluxe",
        "iframe_url": "/gamefiles/superhotlinemiamideluxe/",
        "image": "/images/superhotlinemiamideluxe.png"
    },
    "supermario": {
        "about": "Play this exciting version of Super Mario but now in Flash!",
        "controls": "Press option buttons once in the game",
        "developer": "pouetpu",
        "display_name": "Super Mario Flash",
        "iframe_url": "/swf?notebook=supermario",
        "image": "/images/supermarioflash.webp"
    },
    "supermario63": {
        "about": "Created by passionate and talented fans, this game is naturally inspired by Super Mario 64 and is certainly one of the best retro remake of Mario in flash currently available. Riding a seagull or using a water-propelled jetpack, go in search of Princess Peach and rescue her from the clutches of the nefarious Bowser. The game is full of discoveries of all kinds and a tutorial will luckily take you by the hand to show you all its facets.",
        "controls": "Up: Jump, Left and Right: Walk, Down: Duck/Dive, Z : Talk/Ground Pound, X: Spin Attack, C or Space: Use Fludd, Shift: Switch Fludds, P: Pause Game. - Zoom Out, +Zoom In",
        "developer": "Robert Hewitt",
        "display_name": "Super Mario 63",
        "iframe_url": "/swf?notebook=supermario63",
        "image": "/images/supermario63.jpg"
    },
    "supermario64": {
        "about": "Players take on the role of a security guard who must survive the night shift at a fictional pizza restaurant without being attacked by the animatronic characters that wander through the building.",
        "controls": "On Page",
        "developer": "Scottgames",
        "display_name": "Super Mario 64",
        "iframe_url": "/gamefiles/supermario64/",
        "image": "/images/supermario64.jpg"
    },
    "superraftboat": {
        "about": "The world's been flooded, and all you have is your Super Raft Boat. You keep sailing, hoping to find an island while fighting off the creatures of the sea. From the Clear Skies to the Sea of the Damned, can you reach The Final Island?",
        "controls": "WASD, Left click to shoot, Right click to build your raft more.",
        "developer": "Jasoon Margoon",
        "display_name": "Super Raft Boat",
        "iframe_url": "/gamefiles/superraftboat/",
        "image": "/images/superraftboat.jpg"
    },
    "swerve": {
        "about": "Swerve! That is the only way for you to achieve your ultimate goal in this game. Drive for as long as you can, making sharp turns, often in a row. Increase your speed as you drive farther and farther in hopes of making it to the end of the line. Gifts litter your path and increase your score as you go! Are you up for the ultimate challenge of reaching it to the very end? Can you collect all the gifts as well or will you just swerve off the road and end in failure?",
        "controls": "Click or tap at the right time to let the car change direction. How long can you survive?",
        "developer": "PlayCanvas",
        "display_name": "Swerve",
        "iframe_url": "/gamefiles/swerve/apps.playcanvas.com/VecAxR3e/index.html",
        "image": "/images/swerve.jpg"
    },
    "swordzio": {
        "about": "Swordz.io is the intense online battle game in which you take to the battlefield in an attempt to become the champion. You will start the battle with only a tree branch, you must use your skills to beat players with you limited weapon to gather food. This can be used to upgrade your character so that you can become a force to be reckoned with during the fight.",
        "controls": "WASD or arrow keys to move, Left click to attack, Right click to dash",
        "developer": "Unknown",
        "display_name": "Swordz.io",
        "iframe_url": "/uv.html?site=https://swordz.io/",
        "image": "/images/swordzio.png"
    },
    "tamingio": {
        "about": "Taming-io is a survival .io game with magical pets that fight by your side. Harvest resources and unlock upgrades as you age. Craft items, build a base, and battle other players and their pets to become the savviest survivor.",
        "controls": "WASD or ZQSD or arrow keys to move, Left mouse button to attack",
        "developer": "LapaMauve",
        "display_name": "Taming.io",
        "iframe_url": "/uv.html?site=https://taming.io",
        "image": "/images/tamingio.png"
    },
    "tanukisunset": {
        "about": "Tanuki Sunset is a downhill skateboarding game with a raccoon protagonist called Tanuki. Master the corners and do skateboard tricks to earn points. Enjoy an excellent soundtrack and colorful visuals as you control the coolest raccoon down winding roads into the sunset.",
        "controls": "A/D or left/right arrow to move, W or up arrow to enter speed stance, S or down arrow to do 180-degree slide, Space bar to drift, Esc to pause",
        "developer": "Squid Squad",
        "display_name": "Tanuki Sunset",
        "iframe_url": "/gamefiles/tanukisunset/",
        "image": "/images/tanukisunset.webp"
    },
    "templeofboom": {
        "about": "Enter the battle arena of the Temple of Boom and kill all your enemies in this new game. You can play by yourself (campaign or endless), or you can find a friend and battle him or her! Collect new weapons, health, and ammo by opening the chests that are located throughout each level. Have fun!",
        "controls": "Controls are displayed in game.",
        "developer": "COLIN LANE GAMES",
        "display_name": "Temple of Boom",
        "iframe_url": "/gamefiles/templeofboom/",
        "image": "/images/templeofboom.avif"
    },
    "templerun2": {
        "about": "Temple Run 2, developed by Imangi, is an infinite runner where the player must escape from his enemy and avoid all the obstacles and traps that are found along the way. Traverse cliffs, forests and even mines, and help this fearless treasure hunter escape with the gold idol. But hurry up! The evil monkey monsters are chasing you! Do you dare to join this exciting adrenaline-charged adventure?",
        "controls": "Move - AD or Left/Right arrow keys, Jump - W or Up arrow key, Slide down- S or Down arrow key",
        "developer": "Imangi",
        "display_name": "Temple Run 2",
        "iframe_url": "/gamefiles/templerun2/",
        "image": "/images/templerun2.png"
    },
    "territorial": {
        "about": "Territorial.io is a strategy io game where players fight to expand their nations. Defend your territory, expand, and conquer the map in games of up to 500 players.",
        "controls": "Use the left mouse button to play.",
        "developer": "David Tschacher",
        "display_name": "Territorial.io",
        "iframe_url": "/uv.html?site=https://territorial.io/",
        "image": "/images/territorialio.png"
    },
    "tetralegends": {
        "about": "Tetra Legends is a browser-based, single player fan game in development.",
        "controls": "Check the controls page in the game",
        "developer": "Dr Ocelot",
        "display_name": "Tetra Legends",
        "iframe_url": "/gamefiles/tetralegends/",
        "image": "/images/tetralegends.jpg"
    },
    "tetrisworlds": {
        "about": "Tetris Worlds is the first official game to feature the then-newly-standardized Tetris Guideline; this includes SRS, Hold piece, locking hard drop, infinity move reset, and standard tetromino colors. Unlike later games, Tetris Worlds had an autorepeat feature for the rotation button; holding down the rotation key kept the piece spinning continually.",
        "controls": "You can view the controls (keyboard) in each game in the screen before the game starts. Use the arrow keys and Z, X, C buttons to play. Depending on the console, controls may vary.",
        "developer": "THQ and Sucess",
        "display_name": "Tetris Worlds",
        "iframe_url": "/gba/launcher.html#tetris_worlds",
        "image": "/images/tetrisworlds.jpg"
    },
    "thefinalearth2": {
        "about": "The Final Earth 2 is a vertical city building game. Starting on a small rock in outer-space, you have to build your city and population from the ground up – literally. Resource management and a happy workforce is the key to building a thriving metropolis.",
        "controls": "Use the mouse to play. Tip: Ctrl+Click near a citizen to follow them!",
        "developer": "Florian van Strien",
        "display_name": "The Final Earth 2",
        "iframe_url": "/gamefiles/thefinalearth2/",
        "image": "/images/thefinalearth2.avif"
    },
    "theheist": {
        "about": "The Heist is a free racing game where players play as a professional getaway driver for mobs and bank robbers, earning cash for upgrades. The getting away part is crucial, and players must dodge cops, traffic, and obstacles to arrive alive and pay. Mastering the time-saving feature is a useful tool, but it takes time to master.",
        "controls": "Arrow keys to drive; spacebar for weapon; shift to slow time",
        "developer": "JohnnyTwoShoes",
        "display_name": "The Heist",
        "iframe_url": "/swf?notebook=theheist",
        "image": "/images/theheist.png"
    },
    "thelastio": {
        "about": "TheLast.io is an epic fantasy 2D battle royale game. In this title, you must fight using a variety of magic and melee skills. You must work hard and do what you can to outlast your opponents and be the last character standing!, At the start of the game, you have to launch yourself out of a dragon’s nest, like the Battle Bus in Fortnite! Look out for different loot chests and pick up whatever new weapons and equipment you can!",
        "controls": "Movement: WASD or arrow keys, Aiming/looking: Mouse cursor, Attacking: Left mouse button, Interacting: E, Switching weapon/item: 1-6, mouse wheel, or clicking on the inventory slot, Jumping off the dragon and descending more quickly: Space bar, Use accessory: Space bar",
        "developer": "Dean Édan",
        "display_name": "TheLast.io",
        "iframe_url": "/uv.html?site=https://www.thelast.io/",
        "image": "/images/thelastio.png"
    },
    "thelegendofzeldaocarinaoftime": {
        "about": "Link, raised in an elf-like village, discovers the Great Deku Tree's curse and is sent to Hyrule Castle to investigate. Princess Zelda informs him that Ganondorf, the leader of the Gerudo tribe, seeks the Triforce, a holy relic that grants immense power. Link must save Hyrule by obtaining the Triforce before Ganondorf does.",
        "controls": "Shown on Emulator",
        "developer": "Nintendo EAD",
        "display_name": "The Legend of Zelda Ocarina of Time",
        "iframe_url": "/gamefiles/thelegendofzeldaocarinaoftime/",
        "image": "/images/thelegendofzeldaocarinaoftime.jpg"
    },
    "thereisnogame": {
        "about": "This game, wait is it a game? There is No Game! Or is there? Complete various challenges as the narrator attempts to convince you there is no game. ",
        "controls": "Left click to interact.",
        "developer": "Kamizoto",
        "display_name": "There is no Game",
        "iframe_url": "/gamefiles/thereisnogame/",
        "image": "/images/thereisnogame.png"
    },
    "thevisitor": {
        "about": "The Visitor is a point-and-click game in which you become an alien parasite that needs to consume the living beings to grow and dominate the world. Solve the challenge in each scene and spread the terror!",
        "controls": "Left mouse button to interact with an object.",
        "developer": "Zeebarf",
        "display_name": "The Visitor",
        "iframe_url": "/swf?notebook=thevisitor",
        "image": "/images/thevisitor.jpg"
    },
    "trimps": {
        "about": "Trimps is a resource management, incremental game developed by GreenSatellite, where players control a society of impish creatures called Trimps. With them, the player must venture through zones and maps, defeating a plethora of bad guys in order to obtain loot and unlock upgrades to further their advancement as a society. A journey of conquest and discovery awaits you!",
        "controls": "Click the on screen buttons.",
        "developer": "GreenSatellite",
        "display_name": "Trimps",
        "iframe_url": "/gamefiles/trimps/",
        "image": "/images/trimps.png"
    },
    "tron": {
        "about": "FL Tron is an awesome arcade game that combines aspects of the iconic snake game together with the iconic Tron movies and games. During each level you must control your very own Tron style snake and try to outwite your opponent and box them in - you must try and surround them and force them to crash!",
        "controls": "Jade Controls: WASD to move, Tab to use turbo. Violet Controls: Arrow keys to move, Enter to use turbo",
        "developer": "Dan Hsu",
        "display_name": "Tron",
        "iframe_url": "/swf?notebook=tron",
        "image": "/images/tron.png"
    },
    "tunnelrush": {
        "about": "Zoom at high speed through the colorful tunnel avoiding obstacles. The game takes you through various levels with challenging new obstacles the further you progress!",
        "controls": "Use left and right arrow to move.",
        "developer": "Royale Gamers",
        "display_name": "Tunnel Rush",
        "iframe_url": "/gamefiles/tunnelrush/",
        "image": "/images/tunnelrush.avif"
    },
    "unfairmario": {
        "about": "Unfair Mario is a platform game inspired by Mario and Trap Adventure 2. Can you complete the level without triggering the hidden traps?",
        "controls": "Use the Left and right arrows to move. Use the Up arrow to jump",
        "developer": "Adrian",
        "display_name": "Unfair Mario",
        "iframe_url": "/swf?notebook=unfairmario",
        "image": "/images/unfairmario.jpg"
    },
    "unnecessaryevil": {
        "about": "Glark, Steve, Bonny-chan, Noruto, and Hodur, a team fighting Lord Druksor, wake up in a strange place. They must escape quickly to resume their fight. Glark, the leader, may need drastic actions to return to the light of day. In this puzzle-platformer, players alternate control between five characters and choose which character to sacrifice to overcome obstacles.",
        "controls": "Move - A and D  or  Q and D, Jump - W  or  Z, Step down - S, Change character - SPACE, Restart level - R, Reset game - T",
        "developer": "Eva Abollivier, Agriraldan, Xenation, Suliac on Itch.io",
        "display_name": "Unnecessary Evil",
        "iframe_url": "/gamefiles/unnecessaryevil/",
        "image": "/images/unnecessaryevil.png"
    },
    "vengeio": {
        "about": "Venge.io is a multiplayer FPS game with capture-the-flag mechanics. Select your character, pick a weapon, and jump into the fast-paced action. Use your sharp skills and reflexes to dominate the leaderboard. Unlock cards and use them tactically against your opponents.",
        "controls": "WASD to move, Space bar to jump, R to reload, E to do melee attack, F to throw items, B to buy, Shift or RMG to focus, H to dance, Enter to chat, Hold B to turn cards, LMB to shoot",
        "developer": "Cem Demir",
        "display_name": "venge.io",
        "iframe_url": "/uv.html?site=https://venge.io",
        "image": "/images/vengeio.jpg"
    },
    "vestaviahills": {
        "about": "Vestavia Hills is a Hotline Miami and Call of Duty: Zombies inspired arcade top-down shooter. Featuring a tight and satisfying twist on Hotline Miami combat and an original 16-Bit OST, try to survive to the highest Wave you can.",
        "controls": "Use the Mystery Box (bottom left of the map) to get Weapons, Use the Health Station (in the central room) to regain Health, Enter to Pause, WASD for Movement, Mouse for Aiming, Left Mouse Button to Attack, Right Mouse Button to Interact, R to Reload, G to Drop Current Weapon or Item, Number Row or Scroll Wheel to Swap Weapons/Items",
        "developer": "MD Wade on Itch.io",
        "display_name": "Vestavia Hills",
        "iframe_url": "/gamefiles/vestaviahills/",
        "image": "/images/vestivahills.png"
    },
    "vex5": {
        "about": "Vex 5 is the fifth platform game in the Vex series. Each level is a labyrinth of deadly devices and traps. You have to outsmart these obstacles to reach the end. Expect some of the toughest challenges yet in this fifth installment.",
        "controls": "Use AD or left/right arrow to move. Use W or up arrow to jump. Use S or down arrow to crouch (enter an act)",
        "developer": "Gogy Games",
        "display_name": "Vex 5",
        "iframe_url": "/gamefiles/vex5/",
        "image": "/images/vex5.jpeg"
    },
    "vex6": {
        "about": "Vex 6 is the sixth platform game in the Vex series. There are several new features and challenges in Vex 6. As usual, navigate through a series of tricky traps and obstacles to make it to the end of each level!",
        "controls": "Use AD or left/right arrow to move. Use W or up arrow to jump. Use S or down arrow to crouch (enter an act)",
        "developer": "Gogy Games",
        "display_name": "Vex 6",
        "iframe_url": "/gamefiles/vex6/",
        "image": "/images/vex6.jpeg"
    },
    "warbrokersio": {
        "about": "War Brokers is an intense .io FPS game with various military vehicles and missions. You can customize your player's weapons and vehicles. In each game, you must complete the mission to bring your team to victory. Work together with your teammates and make use of the awesome tank, helicopter, and APC!",
        "controls": "WASD or arrow keys to move or drive. Left-click to shoot. R to reload. Space bar to jump. M to access menu. Tab to open leaderboard",
        "developer": "JoJa15",
        "display_name": "Warbrokers.io",
        "iframe_url": "/uv.html?site=https://warbrokers.io/game3d.php?nick=guest&autoJoin=true&classic=true",
        "image": "/images/warbrokersio.avif"
    },
    "warfare1917": {
        "about": "Lead the British or German army through the trenches of Europe in this First World War strategy game. Use infantry, armor and fire support to take control of the ground or bombard your foes into submission.2 Campaigns. British and German. Custom battle mode. Setup skirmishes the way you want!",
        "controls": "Use your Keyboard to type.",
        "developer": "ConArtists",
        "display_name": "Warfare 1917",
        "iframe_url": "/swf?notebook=warfare1917",
        "image": "/images/warfare1917.png"
    },
    "warfare1944": {
        "about": "Rising out of the trenches and onto the battlefield of Normandy, Warfare 1944 sees the U.S Forces take on the German Wehrmacht.",
        "controls": "Select unit then click on the battlefield to deploy.",
        "developer": "ConArtists",
        "display_name": "Warfare 1944",
        "iframe_url": "/swf?notebook=warfare1944",
        "image": "/images/warfare1944.png"
    },
    "whacktheboss": {
        "about": "This game lets you get out all your inner frustration about your workplace by torturing your boss in different ways. Can you find all 7 ways of whacking him?",
        "controls": "Left click to choose an object.",
        "developer": "Tom Winkler",
        "display_name": "Whack your Boss",
        "iframe_url": "/swf?notebook=whacktheboss",
        "image": "/images/whackyourboss.jpg"
    },
    "whackthecomputer": {
        "about": "Find all 12 objects in the room to whack your computer!",
        "controls": "Click the objects to whack your computer!",
        "developer": "Zeebarf",
        "display_name": "Whack your Computer",
        "iframe_url": "/swf?notebook=whackthecomputer",
        "image": "/images/whackyourcomputer.png"
    },
    "whacktheex": {
        "about": "Whack Your Ex lets you get out all your anger and frustration. Whack and insult your ex as much as you want. Use the items available at the bottom of the cartoon as weapons. In this game you can either whack the ex-boyfriend or the ex-girlfriend using a wide range of brutal methods.",
        "controls": "Use your mouse to play Whack Your Ex.",
        "developer": "Zeebarf",
        "display_name": "Whack your Ex",
        "iframe_url": "/swf?notebook=whacktheex",
        "image": "/images/whackyourex.png"
    },
    "wordleunlimited": {
        "about": "Wordle is a grid of five squares across and six squares down. Each horizontal row of five squares represents an opportunity to guess the random, five-letter word of the day.",
        "controls": "Type with your keyboard",
        "developer": "Josh Wardle",
        "display_name": "Wordle Unlimited",
        "iframe_url": "/gamefiles/wordleunlimited/",
        "image": "/images/wordleunlimited.png"
    },
    "worldbox": {
        "about": "WorldBox is a free god and simulation Sandbox game. In this free Sandbox god game you can create life and watch it prosper! Spawn sheep, wolves, orks, elfs, dwarves and other magic creatures! Civilizations can craft and build houses, roads and go to war with each other. Help them survive, evolve and build powerful civilizations.",
        "controls": "Controls are displayed in game.",
        "developer": "Maxim Karpenko",
        "display_name": "WorldBox Online",
        "iframe_url": "/uv.html?site=https://now.gg/play/maxim-karpenko/1658/worldbox",
        "image": "/images/worldbox.png"
    },
    "worldshardestgame": {
        "about": "This is the self-proclaimed World's Hardest Game. Don't play it; it's too difficult! It really is! Wow this game has to be one of the most challenging but addictive games ever to be made! The aim is simple: all you have to do is guide your red block from one end of the level to the other and collect any yellow circles on the way. This might sound easy, but believe us when we say it isn't!",
        "controls": "Use the arrow keys or WASD",
        "developer": "Stephen Critoph",
        "display_name": "Worlds Hardest Game",
        "iframe_url": "/swf?notebook=worldshardestgame",
        "image": "/images/worldshardestgame.png"
    },
    "worldshardestgame2": {
        "about": "World's Hardest Game 2 is the second episode of the self-proclaimed world's hardest game series! Hone your reflexes and accuracy as you try to move your little block to the end of each stage without touching the obstacles. Doing so will bring you back to the start so you can try again. The difficulty goes up after every stage, so keep your focus and see how far you can get in the World's Hardest Game 2.",
        "controls": "Arrow keys or WASD",
        "developer": "Stephen Critoph",
        "display_name": "World's Hardest Game 2",
        "iframe_url": "/gamefiles/worldshardestgame2/",
        "image": "/images/worldshardestgame2.png"
    },
    "yohoho": {
        "about": "Yohoho is a multiplayer .io game developed by Exodragon Games. In this browser game, you play as a pirate and your objective is to rule the islands. The gameplay is based on eliminating other pirates, collecting gold, and growing in size.",
        "controls": "To move, use your mouse or press WASD/arrow keys, To attack, press left mouse button or space bar. Hold to charge an attack",
        "developer": "Exodragon Games",
        "display_name": "Yohoho",
        "iframe_url": "/uv.html?site=https://yohoho.top/",
        "image": "/images/yohoho.avif"
    },
    "zombocalypse": {
        "about": "Zombocalypse is a free zombie game. Its you vs. a horde of hungry, hungry zombies. Your goal: Make strategic use of limited ammo and health to stay alive (and unlock more powerful weapons). Tip: Call in an airstrike when things get too bitey.",
        "controls": "left/right to move; spacebar to fire; down to pick up weapons and health; up to call airstrike",
        "developer": "Ironzilla",
        "display_name": "Zombocalypse",
        "iframe_url": "/swf?notebook=zombocalypse",
        "image": "/images/zombocalypse.png"
    },
    "zombsroyale": {
        "about": "Zombs Royale is a massive multiplayer Battle Royale game in your browser. Players are represented by circular figures on a 2D grid-like playing field, surrounded by a circular blue zone that shrinks as the game advances. Find weapons across the map in loot boxes such as crates and chests, houses and other buildings.",
        "controls": "WASD or arrow keys to move, M or Tab to view map, E to interact, Left click to shoot, Right click to open emoticon list, R to reload",
        "developer": "End Game",
        "display_name": "Zombs Royale",
        "iframe_url": "/uv.html?site=https://zombsroyale.io/",
        "image": "/images/zombsroyale.png"
    }
}